Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcm100.h
extern volatile __DTR5bits_t DTR5bits __asm__ ("DTR5") __attribute__((section("sfrs"), address(0xBF82A510)));
extern volatile uint32_t        DTR5CLR __attribute__((section("sfrs"),address(0xBF82A514)));
extern volatile uint32_t        DTR5SET __attribute__((section("sfrs"),address(0xBF82A518)));
extern volatile uint32_t        DTR5INV __attribute__((section("sfrs"),address(0xBF82A51C)));
#define ALTDTR5 ALTDTR5
extern volatile uint32_t   ALTDTR5 __attribute__((section("sfrs"), address(0xBF82A520)));
typedef struct {
  uint32_t ALTDTR:16;
} __ALTDTR5bits_t;
extern volatile __ALTDTR5bits_t ALTDTR5bits __asm__ ("ALTDTR5") __attribute__((section("sfrs"), address(0xBF82A520)));
extern volatile uint32_t        ALTDTR5CLR __attribute__((section("sfrs"),address(0xBF82A524)));
extern volatile uint32_t        ALTDTR5SET __attribute__((section("sfrs"),address(0xBF82A528)));
extern volatile uint32_t        ALTDTR5INV __attribute__((section("sfrs"),address(0xBF82A52C)));
#define DTCOMP5 DTCOMP5
extern volatile uint32_t   DTCOMP5 __attribute__((section("sfrs"), address(0xBF82A530)));
typedef struct {
  uint32_t COMP:14;
} __DTCOMP5bits_t;
extern volatile __DTCOMP5bits_t DTCOMP5bits __asm__ ("DTCOMP5") __attribute__((section("sfrs"), address(0xBF82A530)));
extern volatile uint32_t        DTCOMP5CLR __attribute__((section("sfrs"),address(0xBF82A534)));
extern volatile uint32_t        DTCOMP5SET __attribute__((section("sfrs"),address(0xBF82A538)));
extern volatile uint32_t        DTCOMP5INV __attribute__((section("sfrs"),address(0xBF82A53C)));
#define TRIG5 TRIG5
extern volatile uint32_t   TRIG5 __attribute__((section("sfrs"), address(0xBF82A540)));
typedef struct {
  uint32_t TRGCMP:16;
} __TRIG5bits_t;
extern volatile __TRIG5bits_t TRIG5bits __asm__ ("TRIG5") __attribute__((section("sfrs"), address(0xBF82A540)));
extern volatile uint32_t        TRIG5CLR __attribute__((section("sfrs"),address(0xBF82A544)));
extern volatile uint32_t        TRIG5SET __attribute__((section("sfrs"),address(0xBF82A548)));
extern volatile uint32_t        TRIG5INV __attribute__((section("sfrs"),address(0xBF82A54C)));
#define TRGCON5 TRGCON5
extern volatile uint32_t   TRGCON5 __attribute__((section("sfrs"), address(0xBF82A550)));
typedef struct {
  uint32_t :6;
  uint32_t STRGIS:1;
  uint32_t DTM:1;
  uint32_t STRGSEL:2;
  uint32_t TRGSEL:2;
  uint32_t TRGDIV:4;
} __TRGCON5bits_t;
extern volatile __TRGCON5bits_t TRGCON5bits __asm__ ("TRGCON5") __attribute__((section("sfrs"), address(0xBF82A550)));
extern volatile uint32_t        TRGCON5CLR __attribute__((section("sfrs"),address(0xBF82A554)));
extern volatile uint32_t        TRGCON5SET __attribute__((section("sfrs"),address(0xBF82A558)));
extern volatile uint32_t        TRGCON5INV __attribute__((section("sfrs"),address(0xBF82A55C)));
#define STRIG5 STRIG5
extern volatile uint32_t   STRIG5 __attribute__((section("sfrs"), address(0xBF82A560)));
typedef struct {
  uint32_t STRGCMP:16;
} __STRIG5bits_t;
extern volatile __STRIG5bits_t STRIG5bits __asm__ ("STRIG5") __attribute__((section("sfrs"), address(0xBF82A560)));
extern volatile uint32_t        STRIG5CLR __attribute__((section("sfrs"),address(0xBF82A564)));
extern volatile uint32_t        STRIG5SET __attribute__((section("sfrs"),address(0xBF82A568)));
extern volatile uint32_t        STRIG5INV __attribute__((section("sfrs"),address(0xBF82A56C)));
#define CAP5 CAP5
extern volatile uint32_t   CAP5 __attribute__((section("sfrs"), address(0xBF82A570)));
typedef struct {
  uint32_t CAP:16;
} __CAP5bits_t;
extern volatile __CAP5bits_t CAP5bits __asm__ ("CAP5") __attribute__((section("sfrs"), address(0xBF82A570)));
extern volatile uint32_t        CAP5CLR __attribute__((section("sfrs"),address(0xBF82A574)));
extern volatile uint32_t        CAP5SET __attribute__((section("sfrs"),address(0xBF82A578)));
extern volatile uint32_t        CAP5INV __attribute__((section("sfrs"),address(0xBF82A57C)));
#define LEBCON5 LEBCON5
extern volatile uint32_t   LEBCON5 __attribute__((section("sfrs"), address(0xBF82A580)));
typedef struct {
  uint32_t :10;
  uint32_t CLLEBEN:1;
  uint32_t FLTLEBEN:1;
  uint32_t PLF:1;
  uint32_t PLR:1;
  uint32_t PHF:1;
  uint32_t PHR:1;
} __LEBCON5bits_t;
extern volatile __LEBCON5bits_t LEBCON5bits __asm__ ("LEBCON5") __attribute__((section("sfrs"), address(0xBF82A580)));
extern volatile uint32_t        LEBCON5CLR __attribute__((section("sfrs"),address(0xBF82A584)));
extern volatile uint32_t        LEBCON5SET __attribute__((section("sfrs"),address(0xBF82A588)));
extern volatile uint32_t        LEBCON5INV __attribute__((section("sfrs"),address(0xBF82A58C)));
#define LEBDLY5 LEBDLY5
extern volatile uint32_t   LEBDLY5 __attribute__((section("sfrs"), address(0xBF82A590)));
typedef struct {
  uint32_t LEB:12;
} __LEBDLY5bits_t;
extern volatile __LEBDLY5bits_t LEBDLY5bits __asm__ ("LEBDLY5") __attribute__((section("sfrs"), address(0xBF82A590)));
extern volatile uint32_t        LEBDLY5CLR __attribute__((section("sfrs"),address(0xBF82A594)));
extern volatile uint32_t        LEBDLY5SET __attribute__((section("sfrs"),address(0xBF82A598)));
extern volatile uint32_t        LEBDLY5INV __attribute__((section("sfrs"),address(0xBF82A59C)));
#define AUXCON5 AUXCON5
extern volatile uint32_t   AUXCON5 __attribute__((section("sfrs"), address(0xBF82A5A0)));
typedef struct {
  uint32_t CHOPLEN:1;
  uint32_t CHOPHEN:1;
  uint32_t CHOPSEL:4;
} __AUXCON5bits_t;
extern volatile __AUXCON5bits_t AUXCON5bits __asm__ ("AUXCON5") __attribute__((section("sfrs"), address(0xBF82A5A0)));
extern volatile uint32_t        AUXCON5CLR __attribute__((section("sfrs"),address(0xBF82A5A4)));
extern volatile uint32_t        AUXCON5SET __attribute__((section("sfrs"),address(0xBF82A5A8)));
extern volatile uint32_t        AUXCON5INV __attribute__((section("sfrs"),address(0xBF82A5AC)));
#define PTMR5 PTMR5
extern volatile uint32_t   PTMR5 __attribute__((section("sfrs"), address(0xBF82A5B0)));
typedef struct {
  uint32_t TMR:16;
} __PTMR5bits_t;
extern volatile __PTMR5bits_t PTMR5bits __asm__ ("PTMR5") __attribute__((section("sfrs"), address(0xBF82A5B0)));
extern volatile uint32_t        PTMR5CLR __attribute__((section("sfrs"),address(0xBF82A5B4)));
extern volatile uint32_t        PTMR5SET __attribute__((section("sfrs"),address(0xBF82A5B8)));
extern volatile uint32_t        PTMR5INV __attribute__((section("sfrs"),address(0xBF82A5BC)));
#define PWMCON6 PWMCON6
extern volatile uint32_t   PWMCON6 __attribute__((section("sfrs"), address(0xBF82A5C0)));
typedef struct {
  uint32_t :1;
  uint32_t XPRES:1;
  uint32_t :1;
  uint32_t MTBS:1;
  uint32_t PTDIR:1;
  uint32_t DTCP:1;
  uint32_t DTC:2;
  uint32_t :1;
  uint32_t ITB:1;
  uint32_t ECAM:2;
  uint32_t :2;
  uint32_t CLTSTAT:1;
  uint32_t FLTSTAT:1;
  uint32_t :3;
  uint32_t PWMHIEN:1;
  uint32_t PWMLIEN:1;
  uint32_t TRGIEN:1;
  uint32_t CLIEN:1;
  uint32_t FLTIEN:1;
  uint32_t :3;
  uint32_t PWMHIF:1;
  uint32_t PWMLIF:1;
  uint32_t TRGIF:1;
  uint32_t CLIF:1;
  uint32_t FLTIF:1;
} __PWMCON6bits_t;
extern volatile __PWMCON6bits_t PWMCON6bits __asm__ ("PWMCON6") __attribute__((section("sfrs"), address(0xBF82A5C0)));
extern volatile uint32_t        PWMCON6CLR __attribute__((section("sfrs"),address(0xBF82A5C4)));
extern volatile uint32_t        PWMCON6SET __attribute__((section("sfrs"),address(0xBF82A5C8)));
extern volatile uint32_t        PWMCON6INV __attribute__((section("sfrs"),address(0xBF82A5CC)));
#define IOCON6 IOCON6
extern volatile uint32_t   IOCON6 __attribute__((section("sfrs"), address(0xBF82A5D0)));
typedef struct {
  uint32_t OSYNC:1;
  uint32_t SWAP:1;
  uint32_t CLDAT:2;
  uint32_t FLTDAT:2;
  uint32_t OVRDAT:2;
  uint32_t OVRENL:1;
  uint32_t OVRENH:1;
  uint32_t PMOD:2;
  uint32_t POLL:1;
  uint32_t POLH:1;
  uint32_t PENL:1;
  uint32_t PENH:1;
  uint32_t FLTMOD:2;
  uint32_t FLTPOL:1;
  uint32_t FLTSRC:4;
  uint32_t :1;
  uint32_t CLMOD:1;
  uint32_t CLPOL:1;
  uint32_t CLSRC:4;
} __IOCON6bits_t;
extern volatile __IOCON6bits_t IOCON6bits __asm__ ("IOCON6") __attribute__((section("sfrs"), address(0xBF82A5D0)));
extern volatile uint32_t        IOCON6CLR __attribute__((section("sfrs"),address(0xBF82A5D4)));
extern volatile uint32_t        IOCON6SET __attribute__((section("sfrs"),address(0xBF82A5D8)));
extern volatile uint32_t        IOCON6INV __attribute__((section("sfrs"),address(0xBF82A5DC)));
#define PDC6 PDC6
extern volatile uint32_t   PDC6 __attribute__((section("sfrs"), address(0xBF82A5E0)));
typedef struct {
  uint32_t PDC:16;
} __PDC6bits_t;
extern volatile __PDC6bits_t PDC6bits __asm__ ("PDC6") __attribute__((section("sfrs"), address(0xBF82A5E0)));
extern volatile uint32_t        PDC6CLR __attribute__((section("sfrs"),address(0xBF82A5E4)));
extern volatile uint32_t        PDC6SET __attribute__((section("sfrs"),address(0xBF82A5E8)));
extern volatile uint32_t        PDC6INV __attribute__((section("sfrs"),address(0xBF82A5EC)));
#define SDC6 SDC6
extern volatile uint32_t   SDC6 __attribute__((section("sfrs"), address(0xBF82A5F0)));
typedef struct {
  uint32_t SDC:16;
} __SDC6bits_t;
