Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcm100.h
extern volatile __CFD2FIFOUA8bits_t CFD2FIFOUA8bits __asm__ ("CFD2FIFOUA8") __attribute__((section("sfrs"), address(0xBF8812E0)));
extern volatile uint32_t        CFD2FIFOUA8CLR __attribute__((section("sfrs"),address(0xBF8812E4)));
extern volatile uint32_t        CFD2FIFOUA8SET __attribute__((section("sfrs"),address(0xBF8812E8)));
extern volatile uint32_t        CFD2FIFOUA8INV __attribute__((section("sfrs"),address(0xBF8812EC)));
#define CFD2FIFOCON9 CFD2FIFOCON9
extern volatile uint32_t   CFD2FIFOCON9 __attribute__((section("sfrs"), address(0xBF8812F0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON9bits_t;
extern volatile __CFD2FIFOCON9bits_t CFD2FIFOCON9bits __asm__ ("CFD2FIFOCON9") __attribute__((section("sfrs"), address(0xBF8812F0)));
extern volatile uint32_t        CFD2FIFOCON9CLR __attribute__((section("sfrs"),address(0xBF8812F4)));
extern volatile uint32_t        CFD2FIFOCON9SET __attribute__((section("sfrs"),address(0xBF8812F8)));
extern volatile uint32_t        CFD2FIFOCON9INV __attribute__((section("sfrs"),address(0xBF8812FC)));
#define CFD2FIFOSTA9 CFD2FIFOSTA9
extern volatile uint32_t   CFD2FIFOSTA9 __attribute__((section("sfrs"), address(0xBF881300)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA9bits_t;
extern volatile __CFD2FIFOSTA9bits_t CFD2FIFOSTA9bits __asm__ ("CFD2FIFOSTA9") __attribute__((section("sfrs"), address(0xBF881300)));
extern volatile uint32_t        CFD2FIFOSTA9CLR __attribute__((section("sfrs"),address(0xBF881304)));
extern volatile uint32_t        CFD2FIFOSTA9SET __attribute__((section("sfrs"),address(0xBF881308)));
extern volatile uint32_t        CFD2FIFOSTA9INV __attribute__((section("sfrs"),address(0xBF88130C)));
#define CFD2FIFOUA9 CFD2FIFOUA9
extern volatile uint32_t   CFD2FIFOUA9 __attribute__((section("sfrs"), address(0xBF881310)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA9bits_t;
extern volatile __CFD2FIFOUA9bits_t CFD2FIFOUA9bits __asm__ ("CFD2FIFOUA9") __attribute__((section("sfrs"), address(0xBF881310)));
extern volatile uint32_t        CFD2FIFOUA9CLR __attribute__((section("sfrs"),address(0xBF881314)));
extern volatile uint32_t        CFD2FIFOUA9SET __attribute__((section("sfrs"),address(0xBF881318)));
extern volatile uint32_t        CFD2FIFOUA9INV __attribute__((section("sfrs"),address(0xBF88131C)));
#define CFD2FIFOCON10 CFD2FIFOCON10
extern volatile uint32_t   CFD2FIFOCON10 __attribute__((section("sfrs"), address(0xBF881320)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON10bits_t;
extern volatile __CFD2FIFOCON10bits_t CFD2FIFOCON10bits __asm__ ("CFD2FIFOCON10") __attribute__((section("sfrs"), address(0xBF881320)));
extern volatile uint32_t        CFD2FIFOCON10CLR __attribute__((section("sfrs"),address(0xBF881324)));
extern volatile uint32_t        CFD2FIFOCON10SET __attribute__((section("sfrs"),address(0xBF881328)));
extern volatile uint32_t        CFD2FIFOCON10INV __attribute__((section("sfrs"),address(0xBF88132C)));
#define CFD2FIFOSTA10 CFD2FIFOSTA10
extern volatile uint32_t   CFD2FIFOSTA10 __attribute__((section("sfrs"), address(0xBF881330)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA10bits_t;
extern volatile __CFD2FIFOSTA10bits_t CFD2FIFOSTA10bits __asm__ ("CFD2FIFOSTA10") __attribute__((section("sfrs"), address(0xBF881330)));
extern volatile uint32_t        CFD2FIFOSTA10CLR __attribute__((section("sfrs"),address(0xBF881334)));
extern volatile uint32_t        CFD2FIFOSTA10SET __attribute__((section("sfrs"),address(0xBF881338)));
extern volatile uint32_t        CFD2FIFOSTA10INV __attribute__((section("sfrs"),address(0xBF88133C)));
#define CFD2FIFOUA10 CFD2FIFOUA10
extern volatile uint32_t   CFD2FIFOUA10 __attribute__((section("sfrs"), address(0xBF881340)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA10bits_t;
extern volatile __CFD2FIFOUA10bits_t CFD2FIFOUA10bits __asm__ ("CFD2FIFOUA10") __attribute__((section("sfrs"), address(0xBF881340)));
extern volatile uint32_t        CFD2FIFOUA10CLR __attribute__((section("sfrs"),address(0xBF881344)));
extern volatile uint32_t        CFD2FIFOUA10SET __attribute__((section("sfrs"),address(0xBF881348)));
extern volatile uint32_t        CFD2FIFOUA10INV __attribute__((section("sfrs"),address(0xBF88134C)));
#define CFD2FIFOCON11 CFD2FIFOCON11
extern volatile uint32_t   CFD2FIFOCON11 __attribute__((section("sfrs"), address(0xBF881350)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON11bits_t;
extern volatile __CFD2FIFOCON11bits_t CFD2FIFOCON11bits __asm__ ("CFD2FIFOCON11") __attribute__((section("sfrs"), address(0xBF881350)));
extern volatile uint32_t        CFD2FIFOCON11CLR __attribute__((section("sfrs"),address(0xBF881354)));
extern volatile uint32_t        CFD2FIFOCON11SET __attribute__((section("sfrs"),address(0xBF881358)));
extern volatile uint32_t        CFD2FIFOCON11INV __attribute__((section("sfrs"),address(0xBF88135C)));
#define CFD2FIFOSTA11 CFD2FIFOSTA11
extern volatile uint32_t   CFD2FIFOSTA11 __attribute__((section("sfrs"), address(0xBF881360)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA11bits_t;
extern volatile __CFD2FIFOSTA11bits_t CFD2FIFOSTA11bits __asm__ ("CFD2FIFOSTA11") __attribute__((section("sfrs"), address(0xBF881360)));
extern volatile uint32_t        CFD2FIFOSTA11CLR __attribute__((section("sfrs"),address(0xBF881364)));
extern volatile uint32_t        CFD2FIFOSTA11SET __attribute__((section("sfrs"),address(0xBF881368)));
extern volatile uint32_t        CFD2FIFOSTA11INV __attribute__((section("sfrs"),address(0xBF88136C)));
#define CFD2FIFOUA11 CFD2FIFOUA11
extern volatile uint32_t   CFD2FIFOUA11 __attribute__((section("sfrs"), address(0xBF881370)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA11bits_t;
extern volatile __CFD2FIFOUA11bits_t CFD2FIFOUA11bits __asm__ ("CFD2FIFOUA11") __attribute__((section("sfrs"), address(0xBF881370)));
extern volatile uint32_t        CFD2FIFOUA11CLR __attribute__((section("sfrs"),address(0xBF881374)));
extern volatile uint32_t        CFD2FIFOUA11SET __attribute__((section("sfrs"),address(0xBF881378)));
extern volatile uint32_t        CFD2FIFOUA11INV __attribute__((section("sfrs"),address(0xBF88137C)));
#define CFD2FIFOCON12 CFD2FIFOCON12
extern volatile uint32_t   CFD2FIFOCON12 __attribute__((section("sfrs"), address(0xBF881380)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON12bits_t;
