Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcm100.h
extern volatile __CFD2FIFOUA18bits_t CFD2FIFOUA18bits __asm__ ("CFD2FIFOUA18") __attribute__((section("sfrs"), address(0xBF8814C0)));
extern volatile uint32_t        CFD2FIFOUA18CLR __attribute__((section("sfrs"),address(0xBF8814C4)));
extern volatile uint32_t        CFD2FIFOUA18SET __attribute__((section("sfrs"),address(0xBF8814C8)));
extern volatile uint32_t        CFD2FIFOUA18INV __attribute__((section("sfrs"),address(0xBF8814CC)));
#define CFD2FIFOCON19 CFD2FIFOCON19
extern volatile uint32_t   CFD2FIFOCON19 __attribute__((section("sfrs"), address(0xBF8814D0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON19bits_t;
extern volatile __CFD2FIFOCON19bits_t CFD2FIFOCON19bits __asm__ ("CFD2FIFOCON19") __attribute__((section("sfrs"), address(0xBF8814D0)));
extern volatile uint32_t        CFD2FIFOCON19CLR __attribute__((section("sfrs"),address(0xBF8814D4)));
extern volatile uint32_t        CFD2FIFOCON19SET __attribute__((section("sfrs"),address(0xBF8814D8)));
extern volatile uint32_t        CFD2FIFOCON19INV __attribute__((section("sfrs"),address(0xBF8814DC)));
#define CFD2FIFOSTA19 CFD2FIFOSTA19
extern volatile uint32_t   CFD2FIFOSTA19 __attribute__((section("sfrs"), address(0xBF8814E0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA19bits_t;
extern volatile __CFD2FIFOSTA19bits_t CFD2FIFOSTA19bits __asm__ ("CFD2FIFOSTA19") __attribute__((section("sfrs"), address(0xBF8814E0)));
extern volatile uint32_t        CFD2FIFOSTA19CLR __attribute__((section("sfrs"),address(0xBF8814E4)));
extern volatile uint32_t        CFD2FIFOSTA19SET __attribute__((section("sfrs"),address(0xBF8814E8)));
extern volatile uint32_t        CFD2FIFOSTA19INV __attribute__((section("sfrs"),address(0xBF8814EC)));
#define CFD2FIFOUA19 CFD2FIFOUA19
extern volatile uint32_t   CFD2FIFOUA19 __attribute__((section("sfrs"), address(0xBF8814F0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA19bits_t;
extern volatile __CFD2FIFOUA19bits_t CFD2FIFOUA19bits __asm__ ("CFD2FIFOUA19") __attribute__((section("sfrs"), address(0xBF8814F0)));
extern volatile uint32_t        CFD2FIFOUA19CLR __attribute__((section("sfrs"),address(0xBF8814F4)));
extern volatile uint32_t        CFD2FIFOUA19SET __attribute__((section("sfrs"),address(0xBF8814F8)));
extern volatile uint32_t        CFD2FIFOUA19INV __attribute__((section("sfrs"),address(0xBF8814FC)));
#define CFD2FIFOCON20 CFD2FIFOCON20
extern volatile uint32_t   CFD2FIFOCON20 __attribute__((section("sfrs"), address(0xBF881500)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON20bits_t;
extern volatile __CFD2FIFOCON20bits_t CFD2FIFOCON20bits __asm__ ("CFD2FIFOCON20") __attribute__((section("sfrs"), address(0xBF881500)));
extern volatile uint32_t        CFD2FIFOCON20CLR __attribute__((section("sfrs"),address(0xBF881504)));
extern volatile uint32_t        CFD2FIFOCON20SET __attribute__((section("sfrs"),address(0xBF881508)));
extern volatile uint32_t        CFD2FIFOCON20INV __attribute__((section("sfrs"),address(0xBF88150C)));
#define CFD2FIFOSTA20 CFD2FIFOSTA20
extern volatile uint32_t   CFD2FIFOSTA20 __attribute__((section("sfrs"), address(0xBF881510)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA20bits_t;
extern volatile __CFD2FIFOSTA20bits_t CFD2FIFOSTA20bits __asm__ ("CFD2FIFOSTA20") __attribute__((section("sfrs"), address(0xBF881510)));
extern volatile uint32_t        CFD2FIFOSTA20CLR __attribute__((section("sfrs"),address(0xBF881514)));
extern volatile uint32_t        CFD2FIFOSTA20SET __attribute__((section("sfrs"),address(0xBF881518)));
extern volatile uint32_t        CFD2FIFOSTA20INV __attribute__((section("sfrs"),address(0xBF88151C)));
#define CFD2FIFOUA20 CFD2FIFOUA20
extern volatile uint32_t   CFD2FIFOUA20 __attribute__((section("sfrs"), address(0xBF881520)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA20bits_t;
extern volatile __CFD2FIFOUA20bits_t CFD2FIFOUA20bits __asm__ ("CFD2FIFOUA20") __attribute__((section("sfrs"), address(0xBF881520)));
extern volatile uint32_t        CFD2FIFOUA20CLR __attribute__((section("sfrs"),address(0xBF881524)));
extern volatile uint32_t        CFD2FIFOUA20SET __attribute__((section("sfrs"),address(0xBF881528)));
extern volatile uint32_t        CFD2FIFOUA20INV __attribute__((section("sfrs"),address(0xBF88152C)));
#define CFD2FIFOCON21 CFD2FIFOCON21
extern volatile uint32_t   CFD2FIFOCON21 __attribute__((section("sfrs"), address(0xBF881530)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON21bits_t;
extern volatile __CFD2FIFOCON21bits_t CFD2FIFOCON21bits __asm__ ("CFD2FIFOCON21") __attribute__((section("sfrs"), address(0xBF881530)));
extern volatile uint32_t        CFD2FIFOCON21CLR __attribute__((section("sfrs"),address(0xBF881534)));
extern volatile uint32_t        CFD2FIFOCON21SET __attribute__((section("sfrs"),address(0xBF881538)));
extern volatile uint32_t        CFD2FIFOCON21INV __attribute__((section("sfrs"),address(0xBF88153C)));
#define CFD2FIFOSTA21 CFD2FIFOSTA21
extern volatile uint32_t   CFD2FIFOSTA21 __attribute__((section("sfrs"), address(0xBF881540)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA21bits_t;
extern volatile __CFD2FIFOSTA21bits_t CFD2FIFOSTA21bits __asm__ ("CFD2FIFOSTA21") __attribute__((section("sfrs"), address(0xBF881540)));
extern volatile uint32_t        CFD2FIFOSTA21CLR __attribute__((section("sfrs"),address(0xBF881544)));
extern volatile uint32_t        CFD2FIFOSTA21SET __attribute__((section("sfrs"),address(0xBF881548)));
extern volatile uint32_t        CFD2FIFOSTA21INV __attribute__((section("sfrs"),address(0xBF88154C)));
#define CFD2FIFOUA21 CFD2FIFOUA21
extern volatile uint32_t   CFD2FIFOUA21 __attribute__((section("sfrs"), address(0xBF881550)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA21bits_t;
extern volatile __CFD2FIFOUA21bits_t CFD2FIFOUA21bits __asm__ ("CFD2FIFOUA21") __attribute__((section("sfrs"), address(0xBF881550)));
extern volatile uint32_t        CFD2FIFOUA21CLR __attribute__((section("sfrs"),address(0xBF881554)));
extern volatile uint32_t        CFD2FIFOUA21SET __attribute__((section("sfrs"),address(0xBF881558)));
extern volatile uint32_t        CFD2FIFOUA21INV __attribute__((section("sfrs"),address(0xBF88155C)));
#define CFD2FIFOCON22 CFD2FIFOCON22
extern volatile uint32_t   CFD2FIFOCON22 __attribute__((section("sfrs"), address(0xBF881560)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON22bits_t;
extern volatile __CFD2FIFOCON22bits_t CFD2FIFOCON22bits __asm__ ("CFD2FIFOCON22") __attribute__((section("sfrs"), address(0xBF881560)));
extern volatile uint32_t        CFD2FIFOCON22CLR __attribute__((section("sfrs"),address(0xBF881564)));
extern volatile uint32_t        CFD2FIFOCON22SET __attribute__((section("sfrs"),address(0xBF881568)));
extern volatile uint32_t        CFD2FIFOCON22INV __attribute__((section("sfrs"),address(0xBF88156C)));
#define CFD2FIFOSTA22 CFD2FIFOSTA22
extern volatile uint32_t   CFD2FIFOSTA22 __attribute__((section("sfrs"), address(0xBF881570)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA22bits_t;
extern volatile __CFD2FIFOSTA22bits_t CFD2FIFOSTA22bits __asm__ ("CFD2FIFOSTA22") __attribute__((section("sfrs"), address(0xBF881570)));
extern volatile uint32_t        CFD2FIFOSTA22CLR __attribute__((section("sfrs"),address(0xBF881574)));
extern volatile uint32_t        CFD2FIFOSTA22SET __attribute__((section("sfrs"),address(0xBF881578)));
extern volatile uint32_t        CFD2FIFOSTA22INV __attribute__((section("sfrs"),address(0xBF88157C)));
#define CFD2FIFOUA22 CFD2FIFOUA22
extern volatile uint32_t   CFD2FIFOUA22 __attribute__((section("sfrs"), address(0xBF881580)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA22bits_t;
extern volatile __CFD2FIFOUA22bits_t CFD2FIFOUA22bits __asm__ ("CFD2FIFOUA22") __attribute__((section("sfrs"), address(0xBF881580)));
extern volatile uint32_t        CFD2FIFOUA22CLR __attribute__((section("sfrs"),address(0xBF881584)));
extern volatile uint32_t        CFD2FIFOUA22SET __attribute__((section("sfrs"),address(0xBF881588)));
extern volatile uint32_t        CFD2FIFOUA22INV __attribute__((section("sfrs"),address(0xBF88158C)));
#define CFD2FIFOCON23 CFD2FIFOCON23
extern volatile uint32_t   CFD2FIFOCON23 __attribute__((section("sfrs"), address(0xBF881590)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON23bits_t;
extern volatile __CFD2FIFOCON23bits_t CFD2FIFOCON23bits __asm__ ("CFD2FIFOCON23") __attribute__((section("sfrs"), address(0xBF881590)));
extern volatile uint32_t        CFD2FIFOCON23CLR __attribute__((section("sfrs"),address(0xBF881594)));
extern volatile uint32_t        CFD2FIFOCON23SET __attribute__((section("sfrs"),address(0xBF881598)));
extern volatile uint32_t        CFD2FIFOCON23INV __attribute__((section("sfrs"),address(0xBF88159C)));
#define CFD2FIFOSTA23 CFD2FIFOSTA23
extern volatile uint32_t   CFD2FIFOSTA23 __attribute__((section("sfrs"), address(0xBF8815A0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA23bits_t;
