Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcm100.h
extern volatile __CFD3FIFOCON11bits_t CFD3FIFOCON11bits __asm__ ("CFD3FIFOCON11") __attribute__((section("sfrs"), address(0xBF884350)));
extern volatile uint32_t        CFD3FIFOCON11CLR __attribute__((section("sfrs"),address(0xBF884354)));
extern volatile uint32_t        CFD3FIFOCON11SET __attribute__((section("sfrs"),address(0xBF884358)));
extern volatile uint32_t        CFD3FIFOCON11INV __attribute__((section("sfrs"),address(0xBF88435C)));
#define CFD3FIFOSTA11 CFD3FIFOSTA11
extern volatile uint32_t   CFD3FIFOSTA11 __attribute__((section("sfrs"), address(0xBF884360)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA11bits_t;
extern volatile __CFD3FIFOSTA11bits_t CFD3FIFOSTA11bits __asm__ ("CFD3FIFOSTA11") __attribute__((section("sfrs"), address(0xBF884360)));
extern volatile uint32_t        CFD3FIFOSTA11CLR __attribute__((section("sfrs"),address(0xBF884364)));
extern volatile uint32_t        CFD3FIFOSTA11SET __attribute__((section("sfrs"),address(0xBF884368)));
extern volatile uint32_t        CFD3FIFOSTA11INV __attribute__((section("sfrs"),address(0xBF88436C)));
#define CFD3FIFOUA11 CFD3FIFOUA11
extern volatile uint32_t   CFD3FIFOUA11 __attribute__((section("sfrs"), address(0xBF884370)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA11bits_t;
extern volatile __CFD3FIFOUA11bits_t CFD3FIFOUA11bits __asm__ ("CFD3FIFOUA11") __attribute__((section("sfrs"), address(0xBF884370)));
extern volatile uint32_t        CFD3FIFOUA11CLR __attribute__((section("sfrs"),address(0xBF884374)));
extern volatile uint32_t        CFD3FIFOUA11SET __attribute__((section("sfrs"),address(0xBF884378)));
extern volatile uint32_t        CFD3FIFOUA11INV __attribute__((section("sfrs"),address(0xBF88437C)));
#define CFD3FIFOCON12 CFD3FIFOCON12
extern volatile uint32_t   CFD3FIFOCON12 __attribute__((section("sfrs"), address(0xBF884380)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON12bits_t;
extern volatile __CFD3FIFOCON12bits_t CFD3FIFOCON12bits __asm__ ("CFD3FIFOCON12") __attribute__((section("sfrs"), address(0xBF884380)));
extern volatile uint32_t        CFD3FIFOCON12CLR __attribute__((section("sfrs"),address(0xBF884384)));
extern volatile uint32_t        CFD3FIFOCON12SET __attribute__((section("sfrs"),address(0xBF884388)));
extern volatile uint32_t        CFD3FIFOCON12INV __attribute__((section("sfrs"),address(0xBF88438C)));
#define CFD3FIFOSTA12 CFD3FIFOSTA12
extern volatile uint32_t   CFD3FIFOSTA12 __attribute__((section("sfrs"), address(0xBF884390)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA12bits_t;
extern volatile __CFD3FIFOSTA12bits_t CFD3FIFOSTA12bits __asm__ ("CFD3FIFOSTA12") __attribute__((section("sfrs"), address(0xBF884390)));
extern volatile uint32_t        CFD3FIFOSTA12CLR __attribute__((section("sfrs"),address(0xBF884394)));
extern volatile uint32_t        CFD3FIFOSTA12SET __attribute__((section("sfrs"),address(0xBF884398)));
extern volatile uint32_t        CFD3FIFOSTA12INV __attribute__((section("sfrs"),address(0xBF88439C)));
#define CFD3FIFOUA12 CFD3FIFOUA12
extern volatile uint32_t   CFD3FIFOUA12 __attribute__((section("sfrs"), address(0xBF8843A0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA12bits_t;
extern volatile __CFD3FIFOUA12bits_t CFD3FIFOUA12bits __asm__ ("CFD3FIFOUA12") __attribute__((section("sfrs"), address(0xBF8843A0)));
extern volatile uint32_t        CFD3FIFOUA12CLR __attribute__((section("sfrs"),address(0xBF8843A4)));
extern volatile uint32_t        CFD3FIFOUA12SET __attribute__((section("sfrs"),address(0xBF8843A8)));
extern volatile uint32_t        CFD3FIFOUA12INV __attribute__((section("sfrs"),address(0xBF8843AC)));
#define CFD3FIFOCON13 CFD3FIFOCON13
extern volatile uint32_t   CFD3FIFOCON13 __attribute__((section("sfrs"), address(0xBF8843B0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON13bits_t;
extern volatile __CFD3FIFOCON13bits_t CFD3FIFOCON13bits __asm__ ("CFD3FIFOCON13") __attribute__((section("sfrs"), address(0xBF8843B0)));
extern volatile uint32_t        CFD3FIFOCON13CLR __attribute__((section("sfrs"),address(0xBF8843B4)));
extern volatile uint32_t        CFD3FIFOCON13SET __attribute__((section("sfrs"),address(0xBF8843B8)));
extern volatile uint32_t        CFD3FIFOCON13INV __attribute__((section("sfrs"),address(0xBF8843BC)));
#define CFD3FIFOSTA13 CFD3FIFOSTA13
extern volatile uint32_t   CFD3FIFOSTA13 __attribute__((section("sfrs"), address(0xBF8843C0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA13bits_t;
extern volatile __CFD3FIFOSTA13bits_t CFD3FIFOSTA13bits __asm__ ("CFD3FIFOSTA13") __attribute__((section("sfrs"), address(0xBF8843C0)));
extern volatile uint32_t        CFD3FIFOSTA13CLR __attribute__((section("sfrs"),address(0xBF8843C4)));
extern volatile uint32_t        CFD3FIFOSTA13SET __attribute__((section("sfrs"),address(0xBF8843C8)));
extern volatile uint32_t        CFD3FIFOSTA13INV __attribute__((section("sfrs"),address(0xBF8843CC)));
#define CFD3FIFOUA13 CFD3FIFOUA13
extern volatile uint32_t   CFD3FIFOUA13 __attribute__((section("sfrs"), address(0xBF8843D0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA13bits_t;
extern volatile __CFD3FIFOUA13bits_t CFD3FIFOUA13bits __asm__ ("CFD3FIFOUA13") __attribute__((section("sfrs"), address(0xBF8843D0)));
extern volatile uint32_t        CFD3FIFOUA13CLR __attribute__((section("sfrs"),address(0xBF8843D4)));
extern volatile uint32_t        CFD3FIFOUA13SET __attribute__((section("sfrs"),address(0xBF8843D8)));
extern volatile uint32_t        CFD3FIFOUA13INV __attribute__((section("sfrs"),address(0xBF8843DC)));
#define CFD3FIFOCON14 CFD3FIFOCON14
extern volatile uint32_t   CFD3FIFOCON14 __attribute__((section("sfrs"), address(0xBF8843E0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON14bits_t;
