Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcm100.h
extern volatile __CFD3FIFOCON14bits_t CFD3FIFOCON14bits __asm__ ("CFD3FIFOCON14") __attribute__((section("sfrs"), address(0xBF8843E0)));
extern volatile uint32_t        CFD3FIFOCON14CLR __attribute__((section("sfrs"),address(0xBF8843E4)));
extern volatile uint32_t        CFD3FIFOCON14SET __attribute__((section("sfrs"),address(0xBF8843E8)));
extern volatile uint32_t        CFD3FIFOCON14INV __attribute__((section("sfrs"),address(0xBF8843EC)));
#define CFD3FIFOSTA14 CFD3FIFOSTA14
extern volatile uint32_t   CFD3FIFOSTA14 __attribute__((section("sfrs"), address(0xBF8843F0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA14bits_t;
extern volatile __CFD3FIFOSTA14bits_t CFD3FIFOSTA14bits __asm__ ("CFD3FIFOSTA14") __attribute__((section("sfrs"), address(0xBF8843F0)));
extern volatile uint32_t        CFD3FIFOSTA14CLR __attribute__((section("sfrs"),address(0xBF8843F4)));
extern volatile uint32_t        CFD3FIFOSTA14SET __attribute__((section("sfrs"),address(0xBF8843F8)));
extern volatile uint32_t        CFD3FIFOSTA14INV __attribute__((section("sfrs"),address(0xBF8843FC)));
#define CFD3FIFOUA14 CFD3FIFOUA14
extern volatile uint32_t   CFD3FIFOUA14 __attribute__((section("sfrs"), address(0xBF884400)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA14bits_t;
extern volatile __CFD3FIFOUA14bits_t CFD3FIFOUA14bits __asm__ ("CFD3FIFOUA14") __attribute__((section("sfrs"), address(0xBF884400)));
extern volatile uint32_t        CFD3FIFOUA14CLR __attribute__((section("sfrs"),address(0xBF884404)));
extern volatile uint32_t        CFD3FIFOUA14SET __attribute__((section("sfrs"),address(0xBF884408)));
extern volatile uint32_t        CFD3FIFOUA14INV __attribute__((section("sfrs"),address(0xBF88440C)));
#define CFD3FIFOCON15 CFD3FIFOCON15
extern volatile uint32_t   CFD3FIFOCON15 __attribute__((section("sfrs"), address(0xBF884410)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON15bits_t;
extern volatile __CFD3FIFOCON15bits_t CFD3FIFOCON15bits __asm__ ("CFD3FIFOCON15") __attribute__((section("sfrs"), address(0xBF884410)));
extern volatile uint32_t        CFD3FIFOCON15CLR __attribute__((section("sfrs"),address(0xBF884414)));
extern volatile uint32_t        CFD3FIFOCON15SET __attribute__((section("sfrs"),address(0xBF884418)));
extern volatile uint32_t        CFD3FIFOCON15INV __attribute__((section("sfrs"),address(0xBF88441C)));
#define CFD3FIFOSTA15 CFD3FIFOSTA15
extern volatile uint32_t   CFD3FIFOSTA15 __attribute__((section("sfrs"), address(0xBF884420)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA15bits_t;
extern volatile __CFD3FIFOSTA15bits_t CFD3FIFOSTA15bits __asm__ ("CFD3FIFOSTA15") __attribute__((section("sfrs"), address(0xBF884420)));
extern volatile uint32_t        CFD3FIFOSTA15CLR __attribute__((section("sfrs"),address(0xBF884424)));
extern volatile uint32_t        CFD3FIFOSTA15SET __attribute__((section("sfrs"),address(0xBF884428)));
extern volatile uint32_t        CFD3FIFOSTA15INV __attribute__((section("sfrs"),address(0xBF88442C)));
#define CFD3FIFOUA15 CFD3FIFOUA15
extern volatile uint32_t   CFD3FIFOUA15 __attribute__((section("sfrs"), address(0xBF884430)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA15bits_t;
extern volatile __CFD3FIFOUA15bits_t CFD3FIFOUA15bits __asm__ ("CFD3FIFOUA15") __attribute__((section("sfrs"), address(0xBF884430)));
extern volatile uint32_t        CFD3FIFOUA15CLR __attribute__((section("sfrs"),address(0xBF884434)));
extern volatile uint32_t        CFD3FIFOUA15SET __attribute__((section("sfrs"),address(0xBF884438)));
extern volatile uint32_t        CFD3FIFOUA15INV __attribute__((section("sfrs"),address(0xBF88443C)));
#define CFD3FIFOCON16 CFD3FIFOCON16
extern volatile uint32_t   CFD3FIFOCON16 __attribute__((section("sfrs"), address(0xBF884440)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON16bits_t;
extern volatile __CFD3FIFOCON16bits_t CFD3FIFOCON16bits __asm__ ("CFD3FIFOCON16") __attribute__((section("sfrs"), address(0xBF884440)));
extern volatile uint32_t        CFD3FIFOCON16CLR __attribute__((section("sfrs"),address(0xBF884444)));
extern volatile uint32_t        CFD3FIFOCON16SET __attribute__((section("sfrs"),address(0xBF884448)));
extern volatile uint32_t        CFD3FIFOCON16INV __attribute__((section("sfrs"),address(0xBF88444C)));
#define CFD3FIFOSTA16 CFD3FIFOSTA16
extern volatile uint32_t   CFD3FIFOSTA16 __attribute__((section("sfrs"), address(0xBF884450)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA16bits_t;
extern volatile __CFD3FIFOSTA16bits_t CFD3FIFOSTA16bits __asm__ ("CFD3FIFOSTA16") __attribute__((section("sfrs"), address(0xBF884450)));
extern volatile uint32_t        CFD3FIFOSTA16CLR __attribute__((section("sfrs"),address(0xBF884454)));
extern volatile uint32_t        CFD3FIFOSTA16SET __attribute__((section("sfrs"),address(0xBF884458)));
extern volatile uint32_t        CFD3FIFOSTA16INV __attribute__((section("sfrs"),address(0xBF88445C)));
#define CFD3FIFOUA16 CFD3FIFOUA16
extern volatile uint32_t   CFD3FIFOUA16 __attribute__((section("sfrs"), address(0xBF884460)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA16bits_t;
extern volatile __CFD3FIFOUA16bits_t CFD3FIFOUA16bits __asm__ ("CFD3FIFOUA16") __attribute__((section("sfrs"), address(0xBF884460)));
extern volatile uint32_t        CFD3FIFOUA16CLR __attribute__((section("sfrs"),address(0xBF884464)));
extern volatile uint32_t        CFD3FIFOUA16SET __attribute__((section("sfrs"),address(0xBF884468)));
extern volatile uint32_t        CFD3FIFOUA16INV __attribute__((section("sfrs"),address(0xBF88446C)));
#define CFD3FIFOCON17 CFD3FIFOCON17
extern volatile uint32_t   CFD3FIFOCON17 __attribute__((section("sfrs"), address(0xBF884470)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON17bits_t;
extern volatile __CFD3FIFOCON17bits_t CFD3FIFOCON17bits __asm__ ("CFD3FIFOCON17") __attribute__((section("sfrs"), address(0xBF884470)));
extern volatile uint32_t        CFD3FIFOCON17CLR __attribute__((section("sfrs"),address(0xBF884474)));
extern volatile uint32_t        CFD3FIFOCON17SET __attribute__((section("sfrs"),address(0xBF884478)));
extern volatile uint32_t        CFD3FIFOCON17INV __attribute__((section("sfrs"),address(0xBF88447C)));
#define CFD3FIFOSTA17 CFD3FIFOSTA17
extern volatile uint32_t   CFD3FIFOSTA17 __attribute__((section("sfrs"), address(0xBF884480)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA17bits_t;
extern volatile __CFD3FIFOSTA17bits_t CFD3FIFOSTA17bits __asm__ ("CFD3FIFOSTA17") __attribute__((section("sfrs"), address(0xBF884480)));
extern volatile uint32_t        CFD3FIFOSTA17CLR __attribute__((section("sfrs"),address(0xBF884484)));
extern volatile uint32_t        CFD3FIFOSTA17SET __attribute__((section("sfrs"),address(0xBF884488)));
extern volatile uint32_t        CFD3FIFOSTA17INV __attribute__((section("sfrs"),address(0xBF88448C)));
#define CFD3FIFOUA17 CFD3FIFOUA17
extern volatile uint32_t   CFD3FIFOUA17 __attribute__((section("sfrs"), address(0xBF884490)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA17bits_t;
extern volatile __CFD3FIFOUA17bits_t CFD3FIFOUA17bits __asm__ ("CFD3FIFOUA17") __attribute__((section("sfrs"), address(0xBF884490)));
extern volatile uint32_t        CFD3FIFOUA17CLR __attribute__((section("sfrs"),address(0xBF884494)));
extern volatile uint32_t        CFD3FIFOUA17SET __attribute__((section("sfrs"),address(0xBF884498)));
extern volatile uint32_t        CFD3FIFOUA17INV __attribute__((section("sfrs"),address(0xBF88449C)));
#define CFD3FIFOCON18 CFD3FIFOCON18
extern volatile uint32_t   CFD3FIFOCON18 __attribute__((section("sfrs"), address(0xBF8844A0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON18bits_t;
