Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcm100.h
extern volatile __CFD3FIFOUA20bits_t CFD3FIFOUA20bits __asm__ ("CFD3FIFOUA20") __attribute__((section("sfrs"), address(0xBF884520)));
extern volatile uint32_t        CFD3FIFOUA20CLR __attribute__((section("sfrs"),address(0xBF884524)));
extern volatile uint32_t        CFD3FIFOUA20SET __attribute__((section("sfrs"),address(0xBF884528)));
extern volatile uint32_t        CFD3FIFOUA20INV __attribute__((section("sfrs"),address(0xBF88452C)));
#define CFD3FIFOCON21 CFD3FIFOCON21
extern volatile uint32_t   CFD3FIFOCON21 __attribute__((section("sfrs"), address(0xBF884530)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON21bits_t;
extern volatile __CFD3FIFOCON21bits_t CFD3FIFOCON21bits __asm__ ("CFD3FIFOCON21") __attribute__((section("sfrs"), address(0xBF884530)));
extern volatile uint32_t        CFD3FIFOCON21CLR __attribute__((section("sfrs"),address(0xBF884534)));
extern volatile uint32_t        CFD3FIFOCON21SET __attribute__((section("sfrs"),address(0xBF884538)));
extern volatile uint32_t        CFD3FIFOCON21INV __attribute__((section("sfrs"),address(0xBF88453C)));
#define CFD3FIFOSTA21 CFD3FIFOSTA21
extern volatile uint32_t   CFD3FIFOSTA21 __attribute__((section("sfrs"), address(0xBF884540)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA21bits_t;
extern volatile __CFD3FIFOSTA21bits_t CFD3FIFOSTA21bits __asm__ ("CFD3FIFOSTA21") __attribute__((section("sfrs"), address(0xBF884540)));
extern volatile uint32_t        CFD3FIFOSTA21CLR __attribute__((section("sfrs"),address(0xBF884544)));
extern volatile uint32_t        CFD3FIFOSTA21SET __attribute__((section("sfrs"),address(0xBF884548)));
extern volatile uint32_t        CFD3FIFOSTA21INV __attribute__((section("sfrs"),address(0xBF88454C)));
#define CFD3FIFOUA21 CFD3FIFOUA21
extern volatile uint32_t   CFD3FIFOUA21 __attribute__((section("sfrs"), address(0xBF884550)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA21bits_t;
extern volatile __CFD3FIFOUA21bits_t CFD3FIFOUA21bits __asm__ ("CFD3FIFOUA21") __attribute__((section("sfrs"), address(0xBF884550)));
extern volatile uint32_t        CFD3FIFOUA21CLR __attribute__((section("sfrs"),address(0xBF884554)));
extern volatile uint32_t        CFD3FIFOUA21SET __attribute__((section("sfrs"),address(0xBF884558)));
extern volatile uint32_t        CFD3FIFOUA21INV __attribute__((section("sfrs"),address(0xBF88455C)));
#define CFD3FIFOCON22 CFD3FIFOCON22
extern volatile uint32_t   CFD3FIFOCON22 __attribute__((section("sfrs"), address(0xBF884560)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON22bits_t;
extern volatile __CFD3FIFOCON22bits_t CFD3FIFOCON22bits __asm__ ("CFD3FIFOCON22") __attribute__((section("sfrs"), address(0xBF884560)));
extern volatile uint32_t        CFD3FIFOCON22CLR __attribute__((section("sfrs"),address(0xBF884564)));
extern volatile uint32_t        CFD3FIFOCON22SET __attribute__((section("sfrs"),address(0xBF884568)));
extern volatile uint32_t        CFD3FIFOCON22INV __attribute__((section("sfrs"),address(0xBF88456C)));
#define CFD3FIFOSTA22 CFD3FIFOSTA22
extern volatile uint32_t   CFD3FIFOSTA22 __attribute__((section("sfrs"), address(0xBF884570)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA22bits_t;
extern volatile __CFD3FIFOSTA22bits_t CFD3FIFOSTA22bits __asm__ ("CFD3FIFOSTA22") __attribute__((section("sfrs"), address(0xBF884570)));
extern volatile uint32_t        CFD3FIFOSTA22CLR __attribute__((section("sfrs"),address(0xBF884574)));
extern volatile uint32_t        CFD3FIFOSTA22SET __attribute__((section("sfrs"),address(0xBF884578)));
extern volatile uint32_t        CFD3FIFOSTA22INV __attribute__((section("sfrs"),address(0xBF88457C)));
#define CFD3FIFOUA22 CFD3FIFOUA22
extern volatile uint32_t   CFD3FIFOUA22 __attribute__((section("sfrs"), address(0xBF884580)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA22bits_t;
extern volatile __CFD3FIFOUA22bits_t CFD3FIFOUA22bits __asm__ ("CFD3FIFOUA22") __attribute__((section("sfrs"), address(0xBF884580)));
extern volatile uint32_t        CFD3FIFOUA22CLR __attribute__((section("sfrs"),address(0xBF884584)));
extern volatile uint32_t        CFD3FIFOUA22SET __attribute__((section("sfrs"),address(0xBF884588)));
extern volatile uint32_t        CFD3FIFOUA22INV __attribute__((section("sfrs"),address(0xBF88458C)));
#define CFD3FIFOCON23 CFD3FIFOCON23
extern volatile uint32_t   CFD3FIFOCON23 __attribute__((section("sfrs"), address(0xBF884590)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON23bits_t;
extern volatile __CFD3FIFOCON23bits_t CFD3FIFOCON23bits __asm__ ("CFD3FIFOCON23") __attribute__((section("sfrs"), address(0xBF884590)));
extern volatile uint32_t        CFD3FIFOCON23CLR __attribute__((section("sfrs"),address(0xBF884594)));
extern volatile uint32_t        CFD3FIFOCON23SET __attribute__((section("sfrs"),address(0xBF884598)));
extern volatile uint32_t        CFD3FIFOCON23INV __attribute__((section("sfrs"),address(0xBF88459C)));
#define CFD3FIFOSTA23 CFD3FIFOSTA23
extern volatile uint32_t   CFD3FIFOSTA23 __attribute__((section("sfrs"), address(0xBF8845A0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA23bits_t;
extern volatile __CFD3FIFOSTA23bits_t CFD3FIFOSTA23bits __asm__ ("CFD3FIFOSTA23") __attribute__((section("sfrs"), address(0xBF8845A0)));
extern volatile uint32_t        CFD3FIFOSTA23CLR __attribute__((section("sfrs"),address(0xBF8845A4)));
extern volatile uint32_t        CFD3FIFOSTA23SET __attribute__((section("sfrs"),address(0xBF8845A8)));
extern volatile uint32_t        CFD3FIFOSTA23INV __attribute__((section("sfrs"),address(0xBF8845AC)));
#define CFD3FIFOUA23 CFD3FIFOUA23
extern volatile uint32_t   CFD3FIFOUA23 __attribute__((section("sfrs"), address(0xBF8845B0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA23bits_t;
