Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcm100.h
extern volatile __CFD4FIFOSTA22bits_t CFD4FIFOSTA22bits __asm__ ("CFD4FIFOSTA22") __attribute__((section("sfrs"), address(0xBF885570)));
extern volatile uint32_t        CFD4FIFOSTA22CLR __attribute__((section("sfrs"),address(0xBF885574)));
extern volatile uint32_t        CFD4FIFOSTA22SET __attribute__((section("sfrs"),address(0xBF885578)));
extern volatile uint32_t        CFD4FIFOSTA22INV __attribute__((section("sfrs"),address(0xBF88557C)));
#define CFD4FIFOUA22 CFD4FIFOUA22
extern volatile uint32_t   CFD4FIFOUA22 __attribute__((section("sfrs"), address(0xBF885580)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA22bits_t;
extern volatile __CFD4FIFOUA22bits_t CFD4FIFOUA22bits __asm__ ("CFD4FIFOUA22") __attribute__((section("sfrs"), address(0xBF885580)));
extern volatile uint32_t        CFD4FIFOUA22CLR __attribute__((section("sfrs"),address(0xBF885584)));
extern volatile uint32_t        CFD4FIFOUA22SET __attribute__((section("sfrs"),address(0xBF885588)));
extern volatile uint32_t        CFD4FIFOUA22INV __attribute__((section("sfrs"),address(0xBF88558C)));
#define CFD4FIFOCON23 CFD4FIFOCON23
extern volatile uint32_t   CFD4FIFOCON23 __attribute__((section("sfrs"), address(0xBF885590)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON23bits_t;
extern volatile __CFD4FIFOCON23bits_t CFD4FIFOCON23bits __asm__ ("CFD4FIFOCON23") __attribute__((section("sfrs"), address(0xBF885590)));
extern volatile uint32_t        CFD4FIFOCON23CLR __attribute__((section("sfrs"),address(0xBF885594)));
extern volatile uint32_t        CFD4FIFOCON23SET __attribute__((section("sfrs"),address(0xBF885598)));
extern volatile uint32_t        CFD4FIFOCON23INV __attribute__((section("sfrs"),address(0xBF88559C)));
#define CFD4FIFOSTA23 CFD4FIFOSTA23
extern volatile uint32_t   CFD4FIFOSTA23 __attribute__((section("sfrs"), address(0xBF8855A0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA23bits_t;
extern volatile __CFD4FIFOSTA23bits_t CFD4FIFOSTA23bits __asm__ ("CFD4FIFOSTA23") __attribute__((section("sfrs"), address(0xBF8855A0)));
extern volatile uint32_t        CFD4FIFOSTA23CLR __attribute__((section("sfrs"),address(0xBF8855A4)));
extern volatile uint32_t        CFD4FIFOSTA23SET __attribute__((section("sfrs"),address(0xBF8855A8)));
extern volatile uint32_t        CFD4FIFOSTA23INV __attribute__((section("sfrs"),address(0xBF8855AC)));
#define CFD4FIFOUA23 CFD4FIFOUA23
extern volatile uint32_t   CFD4FIFOUA23 __attribute__((section("sfrs"), address(0xBF8855B0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA23bits_t;
extern volatile __CFD4FIFOUA23bits_t CFD4FIFOUA23bits __asm__ ("CFD4FIFOUA23") __attribute__((section("sfrs"), address(0xBF8855B0)));
extern volatile uint32_t        CFD4FIFOUA23CLR __attribute__((section("sfrs"),address(0xBF8855B4)));
extern volatile uint32_t        CFD4FIFOUA23SET __attribute__((section("sfrs"),address(0xBF8855B8)));
extern volatile uint32_t        CFD4FIFOUA23INV __attribute__((section("sfrs"),address(0xBF8855BC)));
#define CFD4FIFOCON24 CFD4FIFOCON24
extern volatile uint32_t   CFD4FIFOCON24 __attribute__((section("sfrs"), address(0xBF8855C0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON24bits_t;
extern volatile __CFD4FIFOCON24bits_t CFD4FIFOCON24bits __asm__ ("CFD4FIFOCON24") __attribute__((section("sfrs"), address(0xBF8855C0)));
extern volatile uint32_t        CFD4FIFOCON24CLR __attribute__((section("sfrs"),address(0xBF8855C4)));
extern volatile uint32_t        CFD4FIFOCON24SET __attribute__((section("sfrs"),address(0xBF8855C8)));
extern volatile uint32_t        CFD4FIFOCON24INV __attribute__((section("sfrs"),address(0xBF8855CC)));
#define CFD4FIFOSTA24 CFD4FIFOSTA24
extern volatile uint32_t   CFD4FIFOSTA24 __attribute__((section("sfrs"), address(0xBF8855D0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA24bits_t;
extern volatile __CFD4FIFOSTA24bits_t CFD4FIFOSTA24bits __asm__ ("CFD4FIFOSTA24") __attribute__((section("sfrs"), address(0xBF8855D0)));
extern volatile uint32_t        CFD4FIFOSTA24CLR __attribute__((section("sfrs"),address(0xBF8855D4)));
extern volatile uint32_t        CFD4FIFOSTA24SET __attribute__((section("sfrs"),address(0xBF8855D8)));
extern volatile uint32_t        CFD4FIFOSTA24INV __attribute__((section("sfrs"),address(0xBF8855DC)));
#define CFD4FIFOUA24 CFD4FIFOUA24
extern volatile uint32_t   CFD4FIFOUA24 __attribute__((section("sfrs"), address(0xBF8855E0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA24bits_t;
extern volatile __CFD4FIFOUA24bits_t CFD4FIFOUA24bits __asm__ ("CFD4FIFOUA24") __attribute__((section("sfrs"), address(0xBF8855E0)));
extern volatile uint32_t        CFD4FIFOUA24CLR __attribute__((section("sfrs"),address(0xBF8855E4)));
extern volatile uint32_t        CFD4FIFOUA24SET __attribute__((section("sfrs"),address(0xBF8855E8)));
extern volatile uint32_t        CFD4FIFOUA24INV __attribute__((section("sfrs"),address(0xBF8855EC)));
#define CFD4FIFOCON25 CFD4FIFOCON25
extern volatile uint32_t   CFD4FIFOCON25 __attribute__((section("sfrs"), address(0xBF8855F0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON25bits_t;
extern volatile __CFD4FIFOCON25bits_t CFD4FIFOCON25bits __asm__ ("CFD4FIFOCON25") __attribute__((section("sfrs"), address(0xBF8855F0)));
extern volatile uint32_t        CFD4FIFOCON25CLR __attribute__((section("sfrs"),address(0xBF8855F4)));
extern volatile uint32_t        CFD4FIFOCON25SET __attribute__((section("sfrs"),address(0xBF8855F8)));
extern volatile uint32_t        CFD4FIFOCON25INV __attribute__((section("sfrs"),address(0xBF8855FC)));
#define CFD4FIFOSTA25 CFD4FIFOSTA25
extern volatile uint32_t   CFD4FIFOSTA25 __attribute__((section("sfrs"), address(0xBF885600)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA25bits_t;
extern volatile __CFD4FIFOSTA25bits_t CFD4FIFOSTA25bits __asm__ ("CFD4FIFOSTA25") __attribute__((section("sfrs"), address(0xBF885600)));
extern volatile uint32_t        CFD4FIFOSTA25CLR __attribute__((section("sfrs"),address(0xBF885604)));
extern volatile uint32_t        CFD4FIFOSTA25SET __attribute__((section("sfrs"),address(0xBF885608)));
extern volatile uint32_t        CFD4FIFOSTA25INV __attribute__((section("sfrs"),address(0xBF88560C)));
#define CFD4FIFOUA25 CFD4FIFOUA25
extern volatile uint32_t   CFD4FIFOUA25 __attribute__((section("sfrs"), address(0xBF885610)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA25bits_t;
