Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcm100.h
  .extern CFD2FLTOBJ1SET   /* 0xBF8817E8 */
  .extern CFD2FLTOBJ1INV   /* 0xBF8817EC */
  .extern CFD2MASK1        /* 0xBF8817F0 */
  .extern CFD2MASK1CLR     /* 0xBF8817F4 */
  .extern CFD2MASK1SET     /* 0xBF8817F8 */
  .extern CFD2MASK1INV     /* 0xBF8817FC */
  .extern CFD2FLTOBJ2      /* 0xBF881800 */
  .extern CFD2FLTOBJ2CLR   /* 0xBF881804 */
  .extern CFD2FLTOBJ2SET   /* 0xBF881808 */
  .extern CFD2FLTOBJ2INV   /* 0xBF88180C */
  .extern CFD2MASK2        /* 0xBF881810 */
  .extern CFD2MASK2CLR     /* 0xBF881814 */
  .extern CFD2MASK2SET     /* 0xBF881818 */
  .extern CFD2MASK2INV     /* 0xBF88181C */
  .extern CFD2FLTOBJ3      /* 0xBF881820 */
  .extern CFD2FLTOBJ3CLR   /* 0xBF881824 */
  .extern CFD2FLTOBJ3SET   /* 0xBF881828 */
  .extern CFD2FLTOBJ3INV   /* 0xBF88182C */
  .extern CFD2MASK3        /* 0xBF881830 */
  .extern CFD2MASK3CLR     /* 0xBF881834 */
  .extern CFD2MASK3SET     /* 0xBF881838 */
  .extern CFD2MASK3INV     /* 0xBF88183C */
  .extern CFD2FLTOBJ4      /* 0xBF881840 */
  .extern CFD2FLTOBJ4CLR   /* 0xBF881844 */
  .extern CFD2FLTOBJ4SET   /* 0xBF881848 */
  .extern CFD2FLTOBJ4INV   /* 0xBF88184C */
  .extern CFD2MASK4        /* 0xBF881850 */
  .extern CFD2MASK4CLR     /* 0xBF881854 */
  .extern CFD2MASK4SET     /* 0xBF881858 */
  .extern CFD2MASK4INV     /* 0xBF88185C */
  .extern CFD2FLTOBJ5      /* 0xBF881860 */
  .extern CFD2FLTOBJ5CLR   /* 0xBF881864 */
  .extern CFD2FLTOBJ5SET   /* 0xBF881868 */
  .extern CFD2FLTOBJ5INV   /* 0xBF88186C */
  .extern CFD2MASK5        /* 0xBF881870 */
  .extern CFD2MASK5CLR     /* 0xBF881874 */
  .extern CFD2MASK5SET     /* 0xBF881878 */
  .extern CFD2MASK5INV     /* 0xBF88187C */
  .extern CFD2FLTOBJ6      /* 0xBF881880 */
  .extern CFD2FLTOBJ6CLR   /* 0xBF881884 */
  .extern CFD2FLTOBJ6SET   /* 0xBF881888 */
  .extern CFD2FLTOBJ6INV   /* 0xBF88188C */
  .extern CFD2MASK6        /* 0xBF881890 */
  .extern CFD2MASK6CLR     /* 0xBF881894 */
  .extern CFD2MASK6SET     /* 0xBF881898 */
  .extern CFD2MASK6INV     /* 0xBF88189C */
  .extern CFD2FLTOBJ7      /* 0xBF8818A0 */
  .extern CFD2FLTOBJ7CLR   /* 0xBF8818A4 */
  .extern CFD2FLTOBJ7SET   /* 0xBF8818A8 */
  .extern CFD2FLTOBJ7INV   /* 0xBF8818AC */
  .extern CFD2MASK7        /* 0xBF8818B0 */
  .extern CFD2MASK7CLR     /* 0xBF8818B4 */
  .extern CFD2MASK7SET     /* 0xBF8818B8 */
  .extern CFD2FLTOBJ8      /* 0xBF8818C0 */
  .extern CFD2FLTOBJ8CLR   /* 0xBF8818C4 */
  .extern CFD2FLTOBJ8SET   /* 0xBF8818C8 */
  .extern CFD2FLTOBJ8INV   /* 0xBF8818CC */
  .extern CFD2MASK8        /* 0xBF8818D0 */
  .extern CFD2MASK8CLR     /* 0xBF8818D4 */
  .extern CFD2MASK8SET     /* 0xBF8818D8 */
  .extern CFD2MASK8INV     /* 0xBF8818DC */
  .extern CFD2FLTOBJ9      /* 0xBF8818E0 */
  .extern CFD2FLTOBJ9CLR   /* 0xBF8818E4 */
  .extern CFD2FLTOBJ9SET   /* 0xBF8818E8 */
  .extern CFD2FLTOBJ9INV   /* 0xBF8818EC */
  .extern CFD2MASK9        /* 0xBF8818F0 */
  .extern CFD2MASK9CLR     /* 0xBF8818F4 */
  .extern CFD2MASK9SET     /* 0xBF8818F8 */
  .extern CFD2MASK9INV     /* 0xBF8818FC */
  .extern CFD2FLTOBJ10     /* 0xBF881900 */
  .extern CFD2FLTOBJ10CLR  /* 0xBF881904 */
  .extern CFD2FLTOBJ10SET  /* 0xBF881908 */
  .extern CFD2FLTOBJ10INV  /* 0xBF88190C */
  .extern CFD2MASK10       /* 0xBF881910 */
  .extern CFD2MASK10CLR    /* 0xBF881914 */
  .extern CFD2MASK10SET    /* 0xBF881918 */
  .extern CFD2MASK10INV    /* 0xBF88191C */
  .extern CFD2FLTOBJ11     /* 0xBF881920 */
  .extern CFD2FLTOBJ11CLR  /* 0xBF881924 */
  .extern CFD2FLTOBJ11SET  /* 0xBF881928 */
  .extern CFD2FLTOBJ11INV  /* 0xBF88192C */
  .extern CFD2MASK11       /* 0xBF881930 */
  .extern CFD2MASK11CLR    /* 0xBF881934 */
  .extern CFD2MASK11SET    /* 0xBF881938 */
  .extern CFD2MASK11INV    /* 0xBF88193C */
  .extern CFD2FLTOBJ12     /* 0xBF881940 */
  .extern CFD2FLTOBJ12CLR  /* 0xBF881944 */
  .extern CFD2FLTOBJ12SET  /* 0xBF881948 */
  .extern CFD2FLTOBJ12INV  /* 0xBF88194C */
  .extern CFD2MASK12       /* 0xBF881950 */
  .extern CFD2MASK12CLR    /* 0xBF881954 */
  .extern CFD2MASK12SET    /* 0xBF881958 */
  .extern CFD2MASK12INV    /* 0xBF88195C */
  .extern CFD2FLTOBJ13     /* 0xBF881960 */
  .extern CFD2FLTOBJ13CLR  /* 0xBF881964 */
  .extern CFD2FLTOBJ13SET  /* 0xBF881968 */
  .extern CFD2FLTOBJ13INV  /* 0xBF88196C */
  .extern CFD2MASK13       /* 0xBF881970 */
  .extern CFD2MASK13CLR    /* 0xBF881974 */
  .extern CFD2MASK13SET    /* 0xBF881978 */
  .extern CFD2MASK13INV    /* 0xBF88197C */
  .extern CFD2FLTOBJ14     /* 0xBF881980 */
  .extern CFD2FLTOBJ14CLR  /* 0xBF881984 */
  .extern CFD2FLTOBJ14SET  /* 0xBF881988 */
  .extern CFD2FLTOBJ14INV  /* 0xBF88198C */
  .extern CFD2MASK14       /* 0xBF881990 */
  .extern CFD2MASK14CLR    /* 0xBF881994 */
  .extern CFD2MASK14SET    /* 0xBF881998 */
  .extern CFD2MASK14INV    /* 0xBF88199C */
  .extern CFD2FLTOBJ15     /* 0xBF8819A0 */
  .extern CFD2FLTOBJ15CLR  /* 0xBF8819A4 */
  .extern CFD2FLTOBJ15SET  /* 0xBF8819A8 */
  .extern CFD2FLTOBJ15INV  /* 0xBF8819AC */
  .extern CFD2MASK15       /* 0xBF8819B0 */
  .extern CFD2MASK15CLR    /* 0xBF8819B4 */
  .extern CFD2MASK15SET    /* 0xBF8819B8 */
  .extern CFD2MASK15INV    /* 0xBF8819BC */
  .extern CFD2FLTOBJ16     /* 0xBF8819C0 */
  .extern CFD2FLTOBJ16CLR  /* 0xBF8819C4 */
  .extern CFD2FLTOBJ16SET  /* 0xBF8819C8 */
  .extern CFD2FLTOBJ16INV  /* 0xBF8819CC */
  .extern CFD2MASK16       /* 0xBF8819D0 */
  .extern CFD2MASK16CLR    /* 0xBF8819D4 */
  .extern CFD2MASK16SET    /* 0xBF8819D8 */
  .extern CFD2MASK16INV    /* 0xBF8819DC */
  .extern CFD2FLTOBJ17     /* 0xBF8819E0 */
  .extern CFD2FLTOBJ17CLR  /* 0xBF8819E4 */
  .extern CFD2FLTOBJ17SET  /* 0xBF8819E8 */
  .extern CFD2FLTOBJ17INV  /* 0xBF8819EC */
  .extern CFD2MASK17       /* 0xBF8819F0 */
  .extern CFD2MASK17CLR    /* 0xBF8819F4 */
  .extern CFD2MASK17SET    /* 0xBF8819F8 */
  .extern CFD2MASK17INV    /* 0xBF8819FC */
  .extern CFD2FLTOBJ18     /* 0xBF881A00 */
  .extern CFD2FLTOBJ18CLR  /* 0xBF881A04 */
  .extern CFD2FLTOBJ18SET  /* 0xBF881A08 */
  .extern CFD2FLTOBJ18INV  /* 0xBF881A0C */
  .extern CFD2MASK18       /* 0xBF881A10 */
  .extern CFD2MASK18CLR    /* 0xBF881A14 */
  .extern CFD2MASK18SET    /* 0xBF881A18 */
  .extern CFD2MASK18INV    /* 0xBF881A1C */
  .extern CFD2FLTOBJ19     /* 0xBF881A20 */
  .extern CFD2FLTOBJ19CLR  /* 0xBF881A24 */
  .extern CFD2FLTOBJ19SET  /* 0xBF881A28 */
  .extern CFD2FLTOBJ19INV  /* 0xBF881A2C */
  .extern CFD2MASK19       /* 0xBF881A30 */
  .extern CFD2MASK19CLR    /* 0xBF881A34 */
  .extern CFD2MASK19SET    /* 0xBF881A38 */
  .extern CFD2MASK19INV    /* 0xBF881A3C */
  .extern CFD2FLTOBJ20     /* 0xBF881A40 */
  .extern CFD2FLTOBJ20CLR  /* 0xBF881A44 */
  .extern CFD2FLTOBJ20SET  /* 0xBF881A48 */
  .extern CFD2FLTOBJ20INV  /* 0xBF881A4C */
  .extern CFD2MASK20       /* 0xBF881A50 */
  .extern CFD2MASK20CLR    /* 0xBF881A54 */
  .extern CFD2MASK20SET    /* 0xBF881A58 */
  .extern CFD2MASK20INV    /* 0xBF881A5C */
  .extern CFD2FLTOBJ21     /* 0xBF881A60 */
  .extern CFD2FLTOBJ21CLR  /* 0xBF881A64 */
  .extern CFD2FLTOBJ21SET  /* 0xBF881A68 */
  .extern CFD2FLTOBJ21INV  /* 0xBF881A6C */
  .extern CFD2MASK21       /* 0xBF881A70 */
  .extern CFD2MASK21CLR    /* 0xBF881A74 */
  .extern CFD2MASK21SET    /* 0xBF881A78 */
  .extern CFD2MASK21INV    /* 0xBF881A7C */
  .extern CFD2FLTOBJ22     /* 0xBF881A80 */
  .extern CFD2FLTOBJ22CLR  /* 0xBF881A84 */
  .extern CFD2FLTOBJ22SET  /* 0xBF881A88 */
  .extern CFD2FLTOBJ22INV  /* 0xBF881A8C */
  .extern CFD2MASK22       /* 0xBF881A90 */
  .extern CFD2MASK22CLR    /* 0xBF881A94 */
  .extern CFD2MASK22SET    /* 0xBF881A98 */
  .extern CFD2MASK22INV    /* 0xBF881A9C */
  .extern CFD2FLTOBJ23     /* 0xBF881AA0 */
  .extern CFD2FLTOBJ23CLR  /* 0xBF881AA4 */
  .extern CFD2FLTOBJ23SET  /* 0xBF881AA8 */
  .extern CFD2FLTOBJ23INV  /* 0xBF881AAC */
  .extern CFD2MASK23       /* 0xBF881AB0 */
  .extern CFD2MASK23CLR    /* 0xBF881AB4 */
  .extern CFD2MASK23SET    /* 0xBF881AB8 */
  .extern CFD2MASK23INV    /* 0xBF881ABC */
  .extern CFD2FLTOBJ24     /* 0xBF881AC0 */
  .extern CFD2FLTOBJ24CLR  /* 0xBF881AC4 */
  .extern CFD2FLTOBJ24SET  /* 0xBF881AC8 */
  .extern CFD2FLTOBJ24INV  /* 0xBF881ACC */
  .extern CFD2MASK24       /* 0xBF881AD0 */
  .extern CFD2MASK24CLR    /* 0xBF881AD4 */
  .extern CFD2MASK24SET    /* 0xBF881AD8 */
  .extern CFD2MASK24INV    /* 0xBF881ADC */
  .extern CFD2FLTOBJ25     /* 0xBF881AE0 */
  .extern CFD2FLTOBJ25CLR  /* 0xBF881AE4 */
  .extern CFD2FLTOBJ25SET  /* 0xBF881AE8 */
  .extern CFD2FLTOBJ25INV  /* 0xBF881AEC */
  .extern CFD2MASK25       /* 0xBF881AF0 */
  .extern CFD2MASK25CLR    /* 0xBF881AF4 */
  .extern CFD2MASK25SET    /* 0xBF881AF8 */
  .extern CFD2MASK25INV    /* 0xBF881AFC */
  .extern CFD2FLTOBJ26     /* 0xBF881B00 */
  .extern CFD2FLTOBJ26CLR  /* 0xBF881B04 */
  .extern CFD2FLTOBJ26SET  /* 0xBF881B08 */
  .extern CFD2FLTOBJ26INV  /* 0xBF881B0C */
  .extern CFD2MASK26       /* 0xBF881B10 */
  .extern CFD2MASK26CLR    /* 0xBF881B14 */
  .extern CFD2MASK26SET    /* 0xBF881B18 */
  .extern CFD2MASK26INV    /* 0xBF881B1C */
  .extern CFD2FLTOBJ27     /* 0xBF881B20 */
  .extern CFD2FLTOBJ27CLR  /* 0xBF881B24 */
  .extern CFD2FLTOBJ27SET  /* 0xBF881B28 */
  .extern CFD2FLTOBJ27INV  /* 0xBF881B2C */
  .extern CFD2MASK27       /* 0xBF881B30 */
  .extern CFD2MASK27CLR    /* 0xBF881B34 */
  .extern CFD2MASK27SET    /* 0xBF881B38 */
  .extern CFD2MASK27INV    /* 0xBF881B3C */
  .extern CFD2FLTOBJ28     /* 0xBF881B40 */
  .extern CFD2FLTOBJ28CLR  /* 0xBF881B44 */
  .extern CFD2FLTOBJ28SET  /* 0xBF881B48 */
  .extern CFD2FLTOBJ28INV  /* 0xBF881B4C */
  .extern CFD2MASK28       /* 0xBF881B50 */
  .extern CFD2MASK28CLR    /* 0xBF881B54 */
  .extern CFD2MASK28SET    /* 0xBF881B58 */
  .extern CFD2MASK28INV    /* 0xBF881B5C */
  .extern CFD2FLTOBJ29     /* 0xBF881B60 */
  .extern CFD2FLTOBJ29CLR  /* 0xBF881B64 */
  .extern CFD2FLTOBJ29SET  /* 0xBF881B68 */
  .extern CFD2FLTOBJ29INV  /* 0xBF881B6C */
  .extern CFD2MASK29       /* 0xBF881B70 */
  .extern CFD2MASK29CLR    /* 0xBF881B74 */
  .extern CFD2MASK29SET    /* 0xBF881B78 */
  .extern CFD2MASK29INV    /* 0xBF881B7C */
  .extern CFD2FLTOBJ30     /* 0xBF881B80 */
  .extern CFD2FLTOBJ30CLR  /* 0xBF881B84 */
  .extern CFD2FLTOBJ30SET  /* 0xBF881B88 */
  .extern CFD2FLTOBJ30INV  /* 0xBF881B8C */
  .extern CFD2MASK30       /* 0xBF881B90 */
  .extern CFD2MASK30CLR    /* 0xBF881B94 */
  .extern CFD2MASK30SET    /* 0xBF881B98 */
  .extern CFD2MASK30INV    /* 0xBF881B9C */
  .extern CFD2FLTOBJ31     /* 0xBF881BA0 */
  .extern CFD2FLTOBJ31CLR  /* 0xBF881BA4 */
  .extern CFD2FLTOBJ31SET  /* 0xBF881BA8 */
  .extern CFD2FLTOBJ31INV  /* 0xBF881BAC */
  .extern CFD2MASK31       /* 0xBF881BB0 */
  .extern CFD2MASK31CLR    /* 0xBF881BB4 */
  .extern CFD2MASK31SET    /* 0xBF881BB8 */
  .extern CFD2MASK31INV    /* 0xBF881BBC */
  .extern CFD3CON          /* 0xBF884000 */
  .extern CFD3CONCLR       /* 0xBF884004 */
  .extern CFD3CONSET       /* 0xBF884008 */
  .extern CFD3CONINV       /* 0xBF88400C */
  .extern CFD3NBTCFG       /* 0xBF884010 */
  .extern CFD3NBTCFGCLR    /* 0xBF884014 */
  .extern CFD3NBTCFGSET    /* 0xBF884018 */
  .extern CFD3NBTCFGINV    /* 0xBF88401C */
  .extern CFD3DBTCFG       /* 0xBF884020 */
  .extern CFD3DBTCFGCLR    /* 0xBF884024 */
  .extern CFD3DBTCFGSET    /* 0xBF884028 */
  .extern CFD3DBTCFGINV    /* 0xBF88402C */
  .extern CFD3TDC          /* 0xBF884030 */
  .extern CFD3TDCCLR       /* 0xBF884034 */
  .extern CFD3TDCSET       /* 0xBF884038 */
  .extern CFD3TDCINV       /* 0xBF88403C */
  .extern CFD3TBC          /* 0xBF884040 */
  .extern CFD3TBCCLR       /* 0xBF884044 */
  .extern CFD3TBCSET       /* 0xBF884048 */
  .extern CFD3TBCINV       /* 0xBF88404C */
  .extern CFD3TSCON        /* 0xBF884050 */
  .extern CFD3TSCONCLR     /* 0xBF884054 */
  .extern CFD3TSCONSET     /* 0xBF884058 */
  .extern CFD3TSCONINV     /* 0xBF88405C */
  .extern CFD3VEC          /* 0xBF884060 */
  .extern CFD3VECCLR       /* 0xBF884064 */
  .extern CFD3VECSET       /* 0xBF884068 */
  .extern CFD3VECINV       /* 0xBF88406C */
  .extern CFD3INT          /* 0xBF884070 */
  .extern CFD3INTCLR       /* 0xBF884074 */
  .extern CFD3INTSET       /* 0xBF884078 */
  .extern CFD3INTINV       /* 0xBF88407C */
  .extern CFD3RXIF         /* 0xBF884080 */
  .extern CFD3RXIFCLR      /* 0xBF884084 */
  .extern CFD3RXIFSET      /* 0xBF884088 */
  .extern CFD3RXIFINV      /* 0xBF88408C */
  .extern CFD3TXIF         /* 0xBF884090 */
  .extern CFD3TXIFCLR      /* 0xBF884094 */
  .extern CFD3TXIFSET      /* 0xBF884098 */
  .extern CFD3TXIFINV      /* 0xBF88409C */
  .extern CFD3RXOVIF       /* 0xBF8840A0 */
  .extern CFD3RXOVIFCLR    /* 0xBF8840A4 */
  .extern CFD3RXOVIFSET    /* 0xBF8840A8 */
  .extern CFD3RXOVIFINV    /* 0xBF8840AC */
  .extern CFD3TXATIF       /* 0xBF8840B0 */
  .extern CFD3TXATIFCLR    /* 0xBF8840B4 */
  .extern CFD3TXATIFSET    /* 0xBF8840B8 */
  .extern CFD3TXATIFINV    /* 0xBF8840BC */
  .extern CFD3TXREQ        /* 0xBF8840C0 */
  .extern CFD3TXREQCLR     /* 0xBF8840C4 */
  .extern CFD3TXREQSET     /* 0xBF8840C8 */
  .extern CFD3TXREQINV     /* 0xBF8840CC */
  .extern CFD3TREC         /* 0xBF8840D0 */
  .extern CFD3TRECCLR      /* 0xBF8840D4 */
  .extern CFD3TRECSET      /* 0xBF8840D8 */
  .extern CFD3TRECINV      /* 0xBF8840DC */
  .extern CFD3BDIAG0       /* 0xBF8840E0 */
  .extern CFD3BDIAG0CLR    /* 0xBF8840E4 */
  .extern CFD3BDIAG0SET    /* 0xBF8840E8 */
  .extern CFD3BDIAG0INV    /* 0xBF8840EC */
  .extern CFD3BDIAG1       /* 0xBF8840F0 */
  .extern CFD3BDIAG1CLR    /* 0xBF8840F4 */
  .extern CFD3BDIAG1SET    /* 0xBF8840F8 */
  .extern CFD3BDIAG1INV    /* 0xBF8840FC */
  .extern CFD3TEFCON       /* 0xBF884100 */
  .extern CFD3TEFCONCLR    /* 0xBF884104 */
  .extern CFD3TEFCONSET    /* 0xBF884108 */
  .extern CFD3TEFCONINV    /* 0xBF88410C */
  .extern CFD3TEFSTA       /* 0xBF884110 */
  .extern CFD3TEFSTACLR    /* 0xBF884114 */
  .extern CFD3TEFSTASET    /* 0xBF884118 */
  .extern CFD3TEFSTAINV    /* 0xBF88411C */
  .extern CFD3TEFUA        /* 0xBF884120 */
  .extern CFD3TEFUACLR     /* 0xBF884124 */
  .extern CFD3TEFUASET     /* 0xBF884128 */
  .extern CFD3TEFUAINV     /* 0xBF88412C */
  .extern CFD3FIFOBA       /* 0xBF884130 */
  .extern CFD3FIFOBACLR    /* 0xBF884134 */
  .extern CFD3FIFOBASET    /* 0xBF884138 */
  .extern CFD3FIFOBAINV    /* 0xBF88413C */
  .extern CFD3TXQCON       /* 0xBF884140 */
  .extern CFD3TXQCONCLR    /* 0xBF884144 */
  .extern CFD3TXQCONSET    /* 0xBF884148 */
  .extern CFD3TXQCONINV    /* 0xBF88414C */
  .extern CFD3TXQSTA       /* 0xBF884150 */
  .extern CFD3TXQSTACLR    /* 0xBF884154 */
  .extern CFD3TXQSTASET    /* 0xBF884158 */
  .extern CFD3TXQSTAINV    /* 0xBF88415C */
  .extern CFD3TXQUA        /* 0xBF884160 */
  .extern CFD3TXQUACLR     /* 0xBF884164 */
  .extern CFD3TXQUASET     /* 0xBF884168 */
  .extern CFD3TXQUAINV     /* 0xBF88416C */
  .extern CFD3FIFOCON1     /* 0xBF884170 */
  .extern CFD3FIFOCON1CLR  /* 0xBF884174 */
  .extern CFD3FIFOCON1SET  /* 0xBF884178 */
  .extern CFD3FIFOCON1INV  /* 0xBF88417C */
  .extern CFD3FIFOSTA1     /* 0xBF884180 */
  .extern CFD3FIFOSTA1CLR  /* 0xBF884184 */
  .extern CFD3FIFOSTA1SET  /* 0xBF884188 */
  .extern CFD3FIFOSTA1INV  /* 0xBF88418C */
  .extern CFD3FIFOUA1      /* 0xBF884190 */
  .extern CFD3FIFOUA1CLR   /* 0xBF884194 */
  .extern CFD3FIFOUA1SET   /* 0xBF884198 */
  .extern CFD3FIFOUA1INV   /* 0xBF88419C */
  .extern CFD3FIFOCON2     /* 0xBF8841A0 */
  .extern CFD3FIFOCON2CLR  /* 0xBF8841A4 */
  .extern CFD3FIFOCON2SET  /* 0xBF8841A8 */
  .extern CFD3FIFOCON2INV  /* 0xBF8841AC */
  .extern CFD3FIFOSTA2     /* 0xBF8841B0 */
  .extern CFD3FIFOSTA2CLR  /* 0xBF8841B4 */
  .extern CFD3FIFOSTA2SET  /* 0xBF8841B8 */
  .extern CFD3FIFOSTA2INV  /* 0xBF8841BC */
  .extern CFD3FIFOUA2      /* 0xBF8841C0 */
  .extern CFD3FIFOUA2CLR   /* 0xBF8841C4 */
  .extern CFD3FIFOUA2SET   /* 0xBF8841C8 */
  .extern CFD3FIFOUA2INV   /* 0xBF8841CC */
  .extern CFD3FIFOCON3     /* 0xBF8841D0 */
  .extern CFD3FIFOCON3CLR  /* 0xBF8841D4 */
  .extern CFD3FIFOCON3SET  /* 0xBF8841D8 */
  .extern CFD3FIFOCON3INV  /* 0xBF8841DC */
  .extern CFD3FIFOSTA3     /* 0xBF8841E0 */
  .extern CFD3FIFOSTA3CLR  /* 0xBF8841E4 */
  .extern CFD3FIFOSTA3SET  /* 0xBF8841E8 */
  .extern CFD3FIFOSTA3INV  /* 0xBF8841EC */
  .extern CFD3FIFOUA3      /* 0xBF8841F0 */
  .extern CFD3FIFOUA3CLR   /* 0xBF8841F4 */
  .extern CFD3FIFOUA3SET   /* 0xBF8841F8 */
  .extern CFD3FIFOUA3INV   /* 0xBF8841FC */
  .extern CFD3FIFOCON4     /* 0xBF884200 */
  .extern CFD3FIFOCON4CLR  /* 0xBF884204 */
  .extern CFD3FIFOCON4SET  /* 0xBF884208 */
  .extern CFD3FIFOCON4INV  /* 0xBF88420C */
  .extern CFD3FIFOSTA4     /* 0xBF884210 */
  .extern CFD3FIFOSTA4CLR  /* 0xBF884214 */
  .extern CFD3FIFOSTA4SET  /* 0xBF884218 */
  .extern CFD3FIFOSTA4INV  /* 0xBF88421C */
  .extern CFD3FIFOUA4      /* 0xBF884220 */
  .extern CFD3FIFOUA4CLR   /* 0xBF884224 */
  .extern CFD3FIFOUA4SET   /* 0xBF884228 */
  .extern CFD3FIFOUA4INV   /* 0xBF88422C */
  .extern CFD3FIFOCON5     /* 0xBF884230 */
  .extern CFD3FIFOCON5CLR  /* 0xBF884234 */
  .extern CFD3FIFOCON5SET  /* 0xBF884238 */
  .extern CFD3FIFOCON5INV  /* 0xBF88423C */
  .extern CFD3FIFOSTA5     /* 0xBF884240 */
  .extern CFD3FIFOSTA5CLR  /* 0xBF884244 */
  .extern CFD3FIFOSTA5SET  /* 0xBF884248 */
  .extern CFD3FIFOSTA5INV  /* 0xBF88424C */
  .extern CFD3FIFOUA5      /* 0xBF884250 */
  .extern CFD3FIFOUA5CLR   /* 0xBF884254 */
  .extern CFD3FIFOUA5SET   /* 0xBF884258 */
  .extern CFD3FIFOUA5INV   /* 0xBF88425C */
  .extern CFD3FIFOCON6     /* 0xBF884260 */
  .extern CFD3FIFOCON6CLR  /* 0xBF884264 */
  .extern CFD3FIFOCON6SET  /* 0xBF884268 */
  .extern CFD3FIFOCON6INV  /* 0xBF88426C */
  .extern CFD3FIFOSTA6     /* 0xBF884270 */
  .extern CFD3FIFOSTA6CLR  /* 0xBF884274 */
  .extern CFD3FIFOSTA6SET  /* 0xBF884278 */
  .extern CFD3FIFOSTA6INV  /* 0xBF88427C */
  .extern CFD3FIFOUA6      /* 0xBF884280 */
  .extern CFD3FIFOUA6CLR   /* 0xBF884284 */
  .extern CFD3FIFOUA6SET   /* 0xBF884288 */
  .extern CFD3FIFOUA6INV   /* 0xBF88428C */
  .extern CFD3FIFOCON7     /* 0xBF884290 */
  .extern CFD3FIFOCON7CLR  /* 0xBF884294 */
  .extern CFD3FIFOCON7SET  /* 0xBF884298 */
  .extern CFD3FIFOCON7INV  /* 0xBF88429C */
  .extern CFD3FIFOSTA7     /* 0xBF8842A0 */
  .extern CFD3FIFOSTA7CLR  /* 0xBF8842A4 */
  .extern CFD3FIFOSTA7SET  /* 0xBF8842A8 */
  .extern CFD3FIFOSTA7INV  /* 0xBF8842AC */
  .extern CFD3FIFOUA7      /* 0xBF8842B0 */
  .extern CFD3FIFOUA7CLR   /* 0xBF8842B4 */
  .extern CFD3FIFOUA7SET   /* 0xBF8842B8 */
  .extern CFD3FIFOUA7INV   /* 0xBF8842BC */
  .extern CFD3FIFOCON8     /* 0xBF8842C0 */
  .extern CFD3FIFOCON8CLR  /* 0xBF8842C4 */
  .extern CFD3FIFOCON8SET  /* 0xBF8842C8 */
  .extern CFD3FIFOCON8INV  /* 0xBF8842CC */
  .extern CFD3FIFOSTA8     /* 0xBF8842D0 */
  .extern CFD3FIFOSTA8CLR  /* 0xBF8842D4 */
  .extern CFD3FIFOSTA8SET  /* 0xBF8842D8 */
  .extern CFD3FIFOSTA8INV  /* 0xBF8842DC */
  .extern CFD3FIFOUA8      /* 0xBF8842E0 */
  .extern CFD3FIFOUA8CLR   /* 0xBF8842E4 */
  .extern CFD3FIFOUA8SET   /* 0xBF8842E8 */
  .extern CFD3FIFOUA8INV   /* 0xBF8842EC */
  .extern CFD3FIFOCON9     /* 0xBF8842F0 */
  .extern CFD3FIFOCON9CLR  /* 0xBF8842F4 */
  .extern CFD3FIFOCON9SET  /* 0xBF8842F8 */
  .extern CFD3FIFOCON9INV  /* 0xBF8842FC */
  .extern CFD3FIFOSTA9     /* 0xBF884300 */
  .extern CFD3FIFOSTA9CLR  /* 0xBF884304 */
  .extern CFD3FIFOSTA9SET  /* 0xBF884308 */
  .extern CFD3FIFOSTA9INV  /* 0xBF88430C */
  .extern CFD3FIFOUA9      /* 0xBF884310 */
  .extern CFD3FIFOUA9CLR   /* 0xBF884314 */
  .extern CFD3FIFOUA9SET   /* 0xBF884318 */
  .extern CFD3FIFOUA9INV   /* 0xBF88431C */
  .extern CFD3FIFOCON10    /* 0xBF884320 */
  .extern CFD3FIFOCON10CLR /* 0xBF884324 */
  .extern CFD3FIFOCON10SET /* 0xBF884328 */
  .extern CFD3FIFOCON10INV /* 0xBF88432C */
  .extern CFD3FIFOSTA10    /* 0xBF884330 */
  .extern CFD3FIFOSTA10CLR /* 0xBF884334 */
  .extern CFD3FIFOSTA10SET /* 0xBF884338 */
  .extern CFD3FIFOSTA10INV /* 0xBF88433C */
  .extern CFD3FIFOUA10     /* 0xBF884340 */
  .extern CFD3FIFOUA10CLR  /* 0xBF884344 */
  .extern CFD3FIFOUA10SET  /* 0xBF884348 */
  .extern CFD3FIFOUA10INV  /* 0xBF88434C */
  .extern CFD3FIFOCON11    /* 0xBF884350 */
  .extern CFD3FIFOCON11CLR /* 0xBF884354 */
  .extern CFD3FIFOCON11SET /* 0xBF884358 */
  .extern CFD3FIFOCON11INV /* 0xBF88435C */
  .extern CFD3FIFOSTA11    /* 0xBF884360 */
  .extern CFD3FIFOSTA11CLR /* 0xBF884364 */
  .extern CFD3FIFOSTA11SET /* 0xBF884368 */
  .extern CFD3FIFOSTA11INV /* 0xBF88436C */
  .extern CFD3FIFOUA11     /* 0xBF884370 */
  .extern CFD3FIFOUA11CLR  /* 0xBF884374 */
  .extern CFD3FIFOUA11SET  /* 0xBF884378 */
  .extern CFD3FIFOUA11INV  /* 0xBF88437C */
  .extern CFD3FIFOCON12    /* 0xBF884380 */
  .extern CFD3FIFOCON12CLR /* 0xBF884384 */
  .extern CFD3FIFOCON12SET /* 0xBF884388 */
  .extern CFD3FIFOCON12INV /* 0xBF88438C */
  .extern CFD3FIFOSTA12    /* 0xBF884390 */
  .extern CFD3FIFOSTA12CLR /* 0xBF884394 */
  .extern CFD3FIFOSTA12SET /* 0xBF884398 */
  .extern CFD3FIFOSTA12INV /* 0xBF88439C */
  .extern CFD3FIFOUA12     /* 0xBF8843A0 */
  .extern CFD3FIFOUA12CLR  /* 0xBF8843A4 */
  .extern CFD3FIFOUA12SET  /* 0xBF8843A8 */
  .extern CFD3FIFOUA12INV  /* 0xBF8843AC */
  .extern CFD3FIFOCON13    /* 0xBF8843B0 */
  .extern CFD3FIFOCON13CLR /* 0xBF8843B4 */
  .extern CFD3FIFOCON13SET /* 0xBF8843B8 */
  .extern CFD3FIFOCON13INV /* 0xBF8843BC */
  .extern CFD3FIFOSTA13    /* 0xBF8843C0 */
  .extern CFD3FIFOSTA13CLR /* 0xBF8843C4 */
  .extern CFD3FIFOSTA13SET /* 0xBF8843C8 */
  .extern CFD3FIFOSTA13INV /* 0xBF8843CC */
  .extern CFD3FIFOUA13     /* 0xBF8843D0 */
  .extern CFD3FIFOUA13CLR  /* 0xBF8843D4 */
  .extern CFD3FIFOUA13SET  /* 0xBF8843D8 */
  .extern CFD3FIFOUA13INV  /* 0xBF8843DC */
  .extern CFD3FIFOCON14    /* 0xBF8843E0 */
  .extern CFD3FIFOCON14CLR /* 0xBF8843E4 */
  .extern CFD3FIFOCON14SET /* 0xBF8843E8 */
  .extern CFD3FIFOCON14INV /* 0xBF8843EC */
  .extern CFD3FIFOSTA14    /* 0xBF8843F0 */
  .extern CFD3FIFOSTA14CLR /* 0xBF8843F4 */
  .extern CFD3FIFOSTA14SET /* 0xBF8843F8 */
  .extern CFD3FIFOSTA14INV /* 0xBF8843FC */
  .extern CFD3FIFOUA14     /* 0xBF884400 */
  .extern CFD3FIFOUA14CLR  /* 0xBF884404 */
  .extern CFD3FIFOUA14SET  /* 0xBF884408 */
  .extern CFD3FIFOUA14INV  /* 0xBF88440C */
  .extern CFD3FIFOCON15    /* 0xBF884410 */
  .extern CFD3FIFOCON15CLR /* 0xBF884414 */
  .extern CFD3FIFOCON15SET /* 0xBF884418 */
  .extern CFD3FIFOCON15INV /* 0xBF88441C */
  .extern CFD3FIFOSTA15    /* 0xBF884420 */
  .extern CFD3FIFOSTA15CLR /* 0xBF884424 */
  .extern CFD3FIFOSTA15SET /* 0xBF884428 */
  .extern CFD3FIFOSTA15INV /* 0xBF88442C */
  .extern CFD3FIFOUA15     /* 0xBF884430 */
  .extern CFD3FIFOUA15CLR  /* 0xBF884434 */
  .extern CFD3FIFOUA15SET  /* 0xBF884438 */
  .extern CFD3FIFOUA15INV  /* 0xBF88443C */
  .extern CFD3FIFOCON16    /* 0xBF884440 */
  .extern CFD3FIFOCON16CLR /* 0xBF884444 */
  .extern CFD3FIFOCON16SET /* 0xBF884448 */
  .extern CFD3FIFOCON16INV /* 0xBF88444C */
  .extern CFD3FIFOSTA16    /* 0xBF884450 */
  .extern CFD3FIFOSTA16CLR /* 0xBF884454 */
  .extern CFD3FIFOSTA16SET /* 0xBF884458 */
  .extern CFD3FIFOSTA16INV /* 0xBF88445C */
  .extern CFD3FIFOUA16     /* 0xBF884460 */
  .extern CFD3FIFOUA16CLR  /* 0xBF884464 */
  .extern CFD3FIFOUA16SET  /* 0xBF884468 */
  .extern CFD3FIFOUA16INV  /* 0xBF88446C */
  .extern CFD3FIFOCON17    /* 0xBF884470 */
  .extern CFD3FIFOCON17CLR /* 0xBF884474 */
  .extern CFD3FIFOCON17SET /* 0xBF884478 */
  .extern CFD3FIFOCON17INV /* 0xBF88447C */
  .extern CFD3FIFOSTA17    /* 0xBF884480 */
  .extern CFD3FIFOSTA17CLR /* 0xBF884484 */
  .extern CFD3FIFOSTA17SET /* 0xBF884488 */
  .extern CFD3FIFOSTA17INV /* 0xBF88448C */
  .extern CFD3FIFOUA17     /* 0xBF884490 */
  .extern CFD3FIFOUA17CLR  /* 0xBF884494 */
  .extern CFD3FIFOUA17SET  /* 0xBF884498 */
  .extern CFD3FIFOUA17INV  /* 0xBF88449C */
  .extern CFD3FIFOCON18    /* 0xBF8844A0 */
  .extern CFD3FIFOCON18CLR /* 0xBF8844A4 */
  .extern CFD3FIFOCON18SET /* 0xBF8844A8 */
  .extern CFD3FIFOCON18INV /* 0xBF8844AC */
