Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcm100.h
#define _PTCON_SEVTPS_POSITION                   0x00000000
#define _PTCON_SEVTPS_MASK                       0x0000000F
#define _PTCON_SEVTPS_LENGTH                     0x00000004

#define _PTCON_PCLKDIV_POSITION                  0x00000004
#define _PTCON_PCLKDIV_MASK                      0x00000070
#define _PTCON_PCLKDIV_LENGTH                    0x00000003

#define _PTCON_PWMRDY_POSITION                   0x0000000A
#define _PTCON_PWMRDY_MASK                       0x00000400
#define _PTCON_PWMRDY_LENGTH                     0x00000001

#define _PTCON_SEIEN_POSITION                    0x0000000B
#define _PTCON_SEIEN_MASK                        0x00000800
#define _PTCON_SEIEN_LENGTH                      0x00000001

#define _PTCON_SESTAT_POSITION                   0x0000000C
#define _PTCON_SESTAT_MASK                       0x00001000
#define _PTCON_SESTAT_LENGTH                     0x00000001

#define _PTCON_PTSIDL_POSITION                   0x0000000D
#define _PTCON_PTSIDL_MASK                       0x00002000
#define _PTCON_PTSIDL_LENGTH                     0x00000001

#define _PTCON_PTEN_POSITION                     0x0000000F
#define _PTCON_PTEN_MASK                         0x00008000
#define _PTCON_PTEN_LENGTH                       0x00000001

#define _PTPER_PTPER_POSITION                    0x00000000
#define _PTPER_PTPER_MASK                        0x0000FFFF
#define _PTPER_PTPER_LENGTH                      0x00000010

#define _SEVTCMP_SEVTCMP_POSITION                0x00000000
#define _SEVTCMP_SEVTCMP_MASK                    0x0000FFFF
#define _SEVTCMP_SEVTCMP_LENGTH                  0x00000010

#define _PMTMR_PMTMR_POSITION                    0x00000000
#define _PMTMR_PMTMR_MASK                        0x0000FFFF
#define _PMTMR_PMTMR_LENGTH                      0x00000010

#define _STCON_SEVTPS_POSITION                   0x00000000
#define _STCON_SEVTPS_MASK                       0x0000000F
#define _STCON_SEVTPS_LENGTH                     0x00000004

#define _STCON_SCLKDIV_POSITION                  0x00000004
#define _STCON_SCLKDIV_MASK                      0x00000070
#define _STCON_SCLKDIV_LENGTH                    0x00000003

#define _STCON_SSEIEN_POSITION                   0x0000000B
#define _STCON_SSEIEN_MASK                       0x00000800
#define _STCON_SSEIEN_LENGTH                     0x00000001

#define _STCON_SSESTAT_POSITION                  0x0000000C
#define _STCON_SSESTAT_MASK                      0x00001000
#define _STCON_SSESTAT_LENGTH                    0x00000001

#define _STPER_STPER_POSITION                    0x00000000
#define _STPER_STPER_MASK                        0x0000FFFF
#define _STPER_STPER_LENGTH                      0x00000010

#define _SSEVTCMP_SSEVTCMP_POSITION              0x00000000
#define _SSEVTCMP_SSEVTCMP_MASK                  0x0000FFFF
#define _SSEVTCMP_SSEVTCMP_LENGTH                0x00000010

#define _SMTMR_SMTMR_POSITION                    0x00000000
#define _SMTMR_SMTMR_MASK                        0x0000FFFF
#define _SMTMR_SMTMR_LENGTH                      0x00000010

#define _CHOP_CHOPCLK_POSITION                   0x00000000
#define _CHOP_CHOPCLK_MASK                       0x000003FF
#define _CHOP_CHOPCLK_LENGTH                     0x0000000A

#define _CHOP_CHPCLKEN_POSITION                  0x0000000F
#define _CHOP_CHPCLKEN_MASK                      0x00008000
#define _CHOP_CHPCLKEN_LENGTH                    0x00000001

#define _PWMKEY_PWMKEY_POSITION                  0x00000000
#define _PWMKEY_PWMKEY_MASK                      0x0000FFFF
#define _PWMKEY_PWMKEY_LENGTH                    0x00000010

#define _PWMCON1_XPRES_POSITION                  0x00000001
#define _PWMCON1_XPRES_MASK                      0x00000002
#define _PWMCON1_XPRES_LENGTH                    0x00000001

#define _PWMCON1_MTBS_POSITION                   0x00000003
#define _PWMCON1_MTBS_MASK                       0x00000008
#define _PWMCON1_MTBS_LENGTH                     0x00000001

#define _PWMCON1_PTDIR_POSITION                  0x00000004
#define _PWMCON1_PTDIR_MASK                      0x00000010
#define _PWMCON1_PTDIR_LENGTH                    0x00000001

#define _PWMCON1_DTCP_POSITION                   0x00000005
#define _PWMCON1_DTCP_MASK                       0x00000020
#define _PWMCON1_DTCP_LENGTH                     0x00000001

#define _PWMCON1_DTC_POSITION                    0x00000006
#define _PWMCON1_DTC_MASK                        0x000000C0
#define _PWMCON1_DTC_LENGTH                      0x00000002

#define _PWMCON1_ITB_POSITION                    0x00000009
#define _PWMCON1_ITB_MASK                        0x00000200
#define _PWMCON1_ITB_LENGTH                      0x00000001

#define _PWMCON1_ECAM_POSITION                   0x0000000A
#define _PWMCON1_ECAM_MASK                       0x00000C00
#define _PWMCON1_ECAM_LENGTH                     0x00000002

#define _PWMCON1_CLTSTAT_POSITION                0x0000000E
#define _PWMCON1_CLTSTAT_MASK                    0x00004000
#define _PWMCON1_CLTSTAT_LENGTH                  0x00000001

#define _PWMCON1_FLTSTAT_POSITION                0x0000000F
#define _PWMCON1_FLTSTAT_MASK                    0x00008000
#define _PWMCON1_FLTSTAT_LENGTH                  0x00000001

#define _PWMCON1_PWMHIEN_POSITION                0x00000013
#define _PWMCON1_PWMHIEN_MASK                    0x00080000
#define _PWMCON1_PWMHIEN_LENGTH                  0x00000001

#define _PWMCON1_PWMLIEN_POSITION                0x00000014
#define _PWMCON1_PWMLIEN_MASK                    0x00100000
#define _PWMCON1_PWMLIEN_LENGTH                  0x00000001

#define _PWMCON1_TRGIEN_POSITION                 0x00000015
#define _PWMCON1_TRGIEN_MASK                     0x00200000
#define _PWMCON1_TRGIEN_LENGTH                   0x00000001

#define _PWMCON1_CLIEN_POSITION                  0x00000016
#define _PWMCON1_CLIEN_MASK                      0x00400000
#define _PWMCON1_CLIEN_LENGTH                    0x00000001

#define _PWMCON1_FLTIEN_POSITION                 0x00000017
#define _PWMCON1_FLTIEN_MASK                     0x00800000
#define _PWMCON1_FLTIEN_LENGTH                   0x00000001

#define _PWMCON1_PWMHIF_POSITION                 0x0000001B
#define _PWMCON1_PWMHIF_MASK                     0x08000000
#define _PWMCON1_PWMHIF_LENGTH                   0x00000001

