Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcm100.h
#define _TRGCON10_TRGSEL_POSITION                0x0000000A
#define _TRGCON10_TRGSEL_MASK                    0x00000C00
#define _TRGCON10_TRGSEL_LENGTH                  0x00000002

#define _TRGCON10_TRGDIV_POSITION                0x0000000C
#define _TRGCON10_TRGDIV_MASK                    0x0000F000
#define _TRGCON10_TRGDIV_LENGTH                  0x00000004

#define _STRIG10_STRGCMP_POSITION                0x00000000
#define _STRIG10_STRGCMP_MASK                    0x0000FFFF
#define _STRIG10_STRGCMP_LENGTH                  0x00000010

#define _CAP10_CAP_POSITION                      0x00000000
#define _CAP10_CAP_MASK                          0x0000FFFF
#define _CAP10_CAP_LENGTH                        0x00000010

#define _LEBCON10_CLLEBEN_POSITION               0x0000000A
#define _LEBCON10_CLLEBEN_MASK                   0x00000400
#define _LEBCON10_CLLEBEN_LENGTH                 0x00000001

#define _LEBCON10_FLTLEBEN_POSITION              0x0000000B
#define _LEBCON10_FLTLEBEN_MASK                  0x00000800
#define _LEBCON10_FLTLEBEN_LENGTH                0x00000001

#define _LEBCON10_PLF_POSITION                   0x0000000C
#define _LEBCON10_PLF_MASK                       0x00001000
#define _LEBCON10_PLF_LENGTH                     0x00000001

#define _LEBCON10_PLR_POSITION                   0x0000000D
#define _LEBCON10_PLR_MASK                       0x00002000
#define _LEBCON10_PLR_LENGTH                     0x00000001

#define _LEBCON10_PHF_POSITION                   0x0000000E
#define _LEBCON10_PHF_MASK                       0x00004000
#define _LEBCON10_PHF_LENGTH                     0x00000001

#define _LEBCON10_PHR_POSITION                   0x0000000F
#define _LEBCON10_PHR_MASK                       0x00008000
#define _LEBCON10_PHR_LENGTH                     0x00000001

#define _LEBDLY10_LEB_POSITION                   0x00000000
#define _LEBDLY10_LEB_MASK                       0x00000FFF
#define _LEBDLY10_LEB_LENGTH                     0x0000000C

#define _AUXCON10_CHOPLEN_POSITION               0x00000000
#define _AUXCON10_CHOPLEN_MASK                   0x00000001
#define _AUXCON10_CHOPLEN_LENGTH                 0x00000001

#define _AUXCON10_CHOPHEN_POSITION               0x00000001
#define _AUXCON10_CHOPHEN_MASK                   0x00000002
#define _AUXCON10_CHOPHEN_LENGTH                 0x00000001

#define _AUXCON10_CHOPSEL_POSITION               0x00000002
#define _AUXCON10_CHOPSEL_MASK                   0x0000003C
#define _AUXCON10_CHOPSEL_LENGTH                 0x00000004

#define _PTMR10_TMR_POSITION                     0x00000000
#define _PTMR10_TMR_MASK                         0x0000FFFF
#define _PTMR10_TMR_LENGTH                       0x00000010

#define _PWMCON11_XPRES_POSITION                 0x00000001
#define _PWMCON11_XPRES_MASK                     0x00000002
#define _PWMCON11_XPRES_LENGTH                   0x00000001

#define _PWMCON11_MTBS_POSITION                  0x00000003
#define _PWMCON11_MTBS_MASK                      0x00000008
#define _PWMCON11_MTBS_LENGTH                    0x00000001

#define _PWMCON11_PTDIR_POSITION                 0x00000004
#define _PWMCON11_PTDIR_MASK                     0x00000010
#define _PWMCON11_PTDIR_LENGTH                   0x00000001

#define _PWMCON11_DTCP_POSITION                  0x00000005
#define _PWMCON11_DTCP_MASK                      0x00000020
#define _PWMCON11_DTCP_LENGTH                    0x00000001

#define _PWMCON11_DTC_POSITION                   0x00000006
#define _PWMCON11_DTC_MASK                       0x000000C0
#define _PWMCON11_DTC_LENGTH                     0x00000002

#define _PWMCON11_ITB_POSITION                   0x00000009
#define _PWMCON11_ITB_MASK                       0x00000200
#define _PWMCON11_ITB_LENGTH                     0x00000001

#define _PWMCON11_ECAM_POSITION                  0x0000000A
#define _PWMCON11_ECAM_MASK                      0x00000C00
#define _PWMCON11_ECAM_LENGTH                    0x00000002

#define _PWMCON11_CLTSTAT_POSITION               0x0000000E
#define _PWMCON11_CLTSTAT_MASK                   0x00004000
#define _PWMCON11_CLTSTAT_LENGTH                 0x00000001

#define _PWMCON11_FLTSTAT_POSITION               0x0000000F
#define _PWMCON11_FLTSTAT_MASK                   0x00008000
#define _PWMCON11_FLTSTAT_LENGTH                 0x00000001

#define _PWMCON11_PWMHIEN_POSITION               0x00000013
#define _PWMCON11_PWMHIEN_MASK                   0x00080000
#define _PWMCON11_PWMHIEN_LENGTH                 0x00000001

#define _PWMCON11_PWMLIEN_POSITION               0x00000014
#define _PWMCON11_PWMLIEN_MASK                   0x00100000
#define _PWMCON11_PWMLIEN_LENGTH                 0x00000001

#define _PWMCON11_TRGIEN_POSITION                0x00000015
#define _PWMCON11_TRGIEN_MASK                    0x00200000
#define _PWMCON11_TRGIEN_LENGTH                  0x00000001

#define _PWMCON11_CLIEN_POSITION                 0x00000016
#define _PWMCON11_CLIEN_MASK                     0x00400000
#define _PWMCON11_CLIEN_LENGTH                   0x00000001

#define _PWMCON11_FLTIEN_POSITION                0x00000017
#define _PWMCON11_FLTIEN_MASK                    0x00800000
#define _PWMCON11_FLTIEN_LENGTH                  0x00000001

#define _PWMCON11_PWMHIF_POSITION                0x0000001B
#define _PWMCON11_PWMHIF_MASK                    0x08000000
#define _PWMCON11_PWMHIF_LENGTH                  0x00000001

#define _PWMCON11_PWMLIF_POSITION                0x0000001C
#define _PWMCON11_PWMLIF_MASK                    0x10000000
#define _PWMCON11_PWMLIF_LENGTH                  0x00000001

#define _PWMCON11_TRGIF_POSITION                 0x0000001D
#define _PWMCON11_TRGIF_MASK                     0x20000000
#define _PWMCON11_TRGIF_LENGTH                   0x00000001

#define _PWMCON11_CLIF_POSITION                  0x0000001E
#define _PWMCON11_CLIF_MASK                      0x40000000
#define _PWMCON11_CLIF_LENGTH                    0x00000001

#define _PWMCON11_FLTIF_POSITION                 0x0000001F
#define _PWMCON11_FLTIF_MASK                     0x80000000
#define _PWMCON11_FLTIF_LENGTH                   0x00000001

