Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcm100.h
#define _CNNEG_CNNEG0_POSITION                   0x00000000
#define _CNNEG_CNNEG0_MASK                       0x00000001
#define _CNNEG_CNNEG0_LENGTH                     0x00000001

#define _CNNEG_CNNEG1_POSITION                   0x00000001
#define _CNNEG_CNNEG1_MASK                       0x00000002
#define _CNNEG_CNNEG1_LENGTH                     0x00000001

#define _CNNEG_CNNEG6_POSITION                   0x00000006
#define _CNNEG_CNNEG6_MASK                       0x00000040
#define _CNNEG_CNNEG6_LENGTH                     0x00000001

#define _CNNEG_CNNEG7_POSITION                   0x00000007
#define _CNNEG_CNNEG7_MASK                       0x00000080
#define _CNNEG_CNNEG7_LENGTH                     0x00000001

#define _CNNEG_CNNEG8_POSITION                   0x00000008
#define _CNNEG_CNNEG8_MASK                       0x00000100
#define _CNNEG_CNNEG8_LENGTH                     0x00000001

#define _CNNEG_CNNEG9_POSITION                   0x00000009
#define _CNNEG_CNNEG9_MASK                       0x00000200
#define _CNNEG_CNNEG9_LENGTH                     0x00000001

#define _CNNEG_CNNEG10_POSITION                  0x0000000A
#define _CNNEG_CNNEG10_MASK                      0x00000400
#define _CNNEG_CNNEG10_LENGTH                    0x00000001

#define _CNNEG_CNNEG11_POSITION                  0x0000000B
#define _CNNEG_CNNEG11_MASK                      0x00000800
#define _CNNEG_CNNEG11_LENGTH                    0x00000001

#define _CNNEG_CNNEG12_POSITION                  0x0000000C
#define _CNNEG_CNNEG12_MASK                      0x00001000
#define _CNNEG_CNNEG12_LENGTH                    0x00000001

#define _CNNEG_CNNEG13_POSITION                  0x0000000D
#define _CNNEG_CNNEG13_MASK                      0x00002000
#define _CNNEG_CNNEG13_LENGTH                    0x00000001

#define _CNNEG_CNNEG14_POSITION                  0x0000000E
#define _CNNEG_CNNEG14_MASK                      0x00004000
#define _CNNEG_CNNEG14_LENGTH                    0x00000001

#define _CNNEG_CNNEG15_POSITION                  0x0000000F
#define _CNNEG_CNNEG15_MASK                      0x00008000
#define _CNNEG_CNNEG15_LENGTH                    0x00000001

#define _CNFG_CNFG0_POSITION                     0x00000000
#define _CNFG_CNFG0_MASK                         0x00000001
#define _CNFG_CNFG0_LENGTH                       0x00000001

#define _CNFG_CNFG1_POSITION                     0x00000001
#define _CNFG_CNFG1_MASK                         0x00000002
#define _CNFG_CNFG1_LENGTH                       0x00000001

#define _CNFG_CNFG6_POSITION                     0x00000006
#define _CNFG_CNFG6_MASK                         0x00000040
#define _CNFG_CNFG6_LENGTH                       0x00000001

#define _CNFG_CNFG7_POSITION                     0x00000007
#define _CNFG_CNFG7_MASK                         0x00000080
#define _CNFG_CNFG7_LENGTH                       0x00000001

#define _CNFG_CNFG8_POSITION                     0x00000008
#define _CNFG_CNFG8_MASK                         0x00000100
#define _CNFG_CNFG8_LENGTH                       0x00000001

#define _CNFG_CNFG9_POSITION                     0x00000009
#define _CNFG_CNFG9_MASK                         0x00000200
#define _CNFG_CNFG9_LENGTH                       0x00000001

#define _CNFG_CNFG10_POSITION                    0x0000000A
#define _CNFG_CNFG10_MASK                        0x00000400
#define _CNFG_CNFG10_LENGTH                      0x00000001

#define _CNFG_CNFG11_POSITION                    0x0000000B
#define _CNFG_CNFG11_MASK                        0x00000800
#define _CNFG_CNFG11_LENGTH                      0x00000001

#define _CNFG_CNFG12_POSITION                    0x0000000C
#define _CNFG_CNFG12_MASK                        0x00001000
#define _CNFG_CNFG12_LENGTH                      0x00000001

#define _CNFG_CNFG13_POSITION                    0x0000000D
#define _CNFG_CNFG13_MASK                        0x00002000
#define _CNFG_CNFG13_LENGTH                      0x00000001

#define _CNFG_CNFG14_POSITION                    0x0000000E
#define _CNFG_CNFG14_MASK                        0x00004000
#define _CNFG_CNFG14_LENGTH                      0x00000001

#define _CNFG_CNFG15_POSITION                    0x0000000F
#define _CNFG_CNFG15_MASK                        0x00008000
#define _CNFG_CNFG15_LENGTH                      0x00000001

#define _CFD1CON_DNCNT_POSITION                  0x00000000
#define _CFD1CON_DNCNT_MASK                      0x0000001F
#define _CFD1CON_DNCNT_LENGTH                    0x00000005

#define _CFD1CON_ISOCRCEN_POSITION               0x00000005
#define _CFD1CON_ISOCRCEN_MASK                   0x00000020
#define _CFD1CON_ISOCRCEN_LENGTH                 0x00000001

#define _CFD1CON_PXEDIS_POSITION                 0x00000006
#define _CFD1CON_PXEDIS_MASK                     0x00000040
#define _CFD1CON_PXEDIS_LENGTH                   0x00000001

#define _CFD1CON_CLKSEL0_POSITION                0x00000007
#define _CFD1CON_CLKSEL0_MASK                    0x00000080
#define _CFD1CON_CLKSEL0_LENGTH                  0x00000001

#define _CFD1CON_WAKFIL_POSITION                 0x00000008
#define _CFD1CON_WAKFIL_MASK                     0x00000100
#define _CFD1CON_WAKFIL_LENGTH                   0x00000001

#define _CFD1CON_WFT_POSITION                    0x00000009
#define _CFD1CON_WFT_MASK                        0x00000600
#define _CFD1CON_WFT_LENGTH                      0x00000002

#define _CFD1CON_BUSY_POSITION                   0x0000000B
#define _CFD1CON_BUSY_MASK                       0x00000800
#define _CFD1CON_BUSY_LENGTH                     0x00000001

#define _CFD1CON_BRSDIS_POSITION                 0x0000000C
#define _CFD1CON_BRSDIS_MASK                     0x00001000
#define _CFD1CON_BRSDIS_LENGTH                   0x00000001

#define _CFD1CON_SIDL_POSITION                   0x0000000D
#define _CFD1CON_SIDL_MASK                       0x00002000
#define _CFD1CON_SIDL_LENGTH                     0x00000001

#define _CFD1CON_ON_POSITION                     0x0000000F
#define _CFD1CON_ON_MASK                         0x00008000
#define _CFD1CON_ON_LENGTH                       0x00000001

#define _CFD1CON_RTXAT_POSITION                  0x00000010
#define _CFD1CON_RTXAT_MASK                      0x00010000
#define _CFD1CON_RTXAT_LENGTH                    0x00000001

#define _CFD1CON_ESIGM_POSITION                  0x00000011
#define _CFD1CON_ESIGM_MASK                      0x00020000
#define _CFD1CON_ESIGM_LENGTH                    0x00000001

#define _CFD1CON_SERR2LOM_POSITION               0x00000012
#define _CFD1CON_SERR2LOM_MASK                   0x00040000
#define _CFD1CON_SERR2LOM_LENGTH                 0x00000001

