Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcm100.h
#define _CFD2FLTOBJ29_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ29_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ29_EXIDE_LENGTH               0x00000001

#define _CFD2MASK29_MSID_POSITION                0x00000000
#define _CFD2MASK29_MSID_MASK                    0x000007FF
#define _CFD2MASK29_MSID_LENGTH                  0x0000000B

#define _CFD2MASK29_MEID_POSITION                0x0000000B
#define _CFD2MASK29_MEID_MASK                    0x1FFFF800
#define _CFD2MASK29_MEID_LENGTH                  0x00000012

#define _CFD2MASK29_MSID11_POSITION              0x0000001D
#define _CFD2MASK29_MSID11_MASK                  0x20000000
#define _CFD2MASK29_MSID11_LENGTH                0x00000001

#define _CFD2MASK29_MIDE_POSITION                0x0000001E
#define _CFD2MASK29_MIDE_MASK                    0x40000000
#define _CFD2MASK29_MIDE_LENGTH                  0x00000001

#define _CFD2FLTOBJ30_SID_POSITION               0x00000000
#define _CFD2FLTOBJ30_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ30_SID_LENGTH                 0x0000000B

#define _CFD2FLTOBJ30_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ30_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ30_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ30_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ30_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ30_SID11_LENGTH               0x00000001

#define _CFD2FLTOBJ30_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ30_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ30_EXIDE_LENGTH               0x00000001

#define _CFD2MASK30_MSID_POSITION                0x00000000
#define _CFD2MASK30_MSID_MASK                    0x000007FF
#define _CFD2MASK30_MSID_LENGTH                  0x0000000B

#define _CFD2MASK30_MEID_POSITION                0x0000000B
#define _CFD2MASK30_MEID_MASK                    0x1FFFF800
#define _CFD2MASK30_MEID_LENGTH                  0x00000012

#define _CFD2MASK30_MSID11_POSITION              0x0000001D
#define _CFD2MASK30_MSID11_MASK                  0x20000000
#define _CFD2MASK30_MSID11_LENGTH                0x00000001

#define _CFD2MASK30_MIDE_POSITION                0x0000001E
#define _CFD2MASK30_MIDE_MASK                    0x40000000
#define _CFD2MASK30_MIDE_LENGTH                  0x00000001

#define _CFD2FLTOBJ31_SID_POSITION               0x00000000
#define _CFD2FLTOBJ31_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ31_SID_LENGTH                 0x0000000B

#define _CFD2FLTOBJ31_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ31_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ31_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ31_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ31_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ31_SID11_LENGTH               0x00000001

#define _CFD2FLTOBJ31_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ31_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ31_EXIDE_LENGTH               0x00000001

#define _CFD2MASK31_MSID_POSITION                0x00000000
#define _CFD2MASK31_MSID_MASK                    0x000007FF
#define _CFD2MASK31_MSID_LENGTH                  0x0000000B

#define _CFD2MASK31_MEID_POSITION                0x0000000B
#define _CFD2MASK31_MEID_MASK                    0x1FFFF800
#define _CFD2MASK31_MEID_LENGTH                  0x00000012

#define _CFD2MASK31_MSID11_POSITION              0x0000001D
#define _CFD2MASK31_MSID11_MASK                  0x20000000
#define _CFD2MASK31_MSID11_LENGTH                0x00000001

#define _CFD2MASK31_MIDE_POSITION                0x0000001E
#define _CFD2MASK31_MIDE_MASK                    0x40000000
#define _CFD2MASK31_MIDE_LENGTH                  0x00000001

#define _CFD3CON_DNCNT_POSITION                  0x00000000
#define _CFD3CON_DNCNT_MASK                      0x0000001F
#define _CFD3CON_DNCNT_LENGTH                    0x00000005

#define _CFD3CON_ISOCRCEN_POSITION               0x00000005
#define _CFD3CON_ISOCRCEN_MASK                   0x00000020
#define _CFD3CON_ISOCRCEN_LENGTH                 0x00000001

#define _CFD3CON_PXEDIS_POSITION                 0x00000006
#define _CFD3CON_PXEDIS_MASK                     0x00000040
#define _CFD3CON_PXEDIS_LENGTH                   0x00000001

#define _CFD3CON_CLKSEL0_POSITION                0x00000007
#define _CFD3CON_CLKSEL0_MASK                    0x00000080
#define _CFD3CON_CLKSEL0_LENGTH                  0x00000001

#define _CFD3CON_WAKFIL_POSITION                 0x00000008
#define _CFD3CON_WAKFIL_MASK                     0x00000100
#define _CFD3CON_WAKFIL_LENGTH                   0x00000001

#define _CFD3CON_WFT_POSITION                    0x00000009
#define _CFD3CON_WFT_MASK                        0x00000600
#define _CFD3CON_WFT_LENGTH                      0x00000002

#define _CFD3CON_BUSY_POSITION                   0x0000000B
#define _CFD3CON_BUSY_MASK                       0x00000800
#define _CFD3CON_BUSY_LENGTH                     0x00000001

#define _CFD3CON_BRSDIS_POSITION                 0x0000000C
#define _CFD3CON_BRSDIS_MASK                     0x00001000
#define _CFD3CON_BRSDIS_LENGTH                   0x00000001

#define _CFD3CON_SIDL_POSITION                   0x0000000D
#define _CFD3CON_SIDL_MASK                       0x00002000
#define _CFD3CON_SIDL_LENGTH                     0x00000001

#define _CFD3CON_ON_POSITION                     0x0000000F
#define _CFD3CON_ON_MASK                         0x00008000
#define _CFD3CON_ON_LENGTH                       0x00000001

#define _CFD3CON_RTXAT_POSITION                  0x00000010
#define _CFD3CON_RTXAT_MASK                      0x00010000
#define _CFD3CON_RTXAT_LENGTH                    0x00000001

#define _CFD3CON_ESIGM_POSITION                  0x00000011
#define _CFD3CON_ESIGM_MASK                      0x00020000
#define _CFD3CON_ESIGM_LENGTH                    0x00000001

#define _CFD3CON_SERR2LOM_POSITION               0x00000012
#define _CFD3CON_SERR2LOM_MASK                   0x00040000
#define _CFD3CON_SERR2LOM_LENGTH                 0x00000001

#define _CFD3CON_STEF_POSITION                   0x00000013
#define _CFD3CON_STEF_MASK                       0x00080000
#define _CFD3CON_STEF_LENGTH                     0x00000001

#define _CFD3CON_TXQEN_POSITION                  0x00000014
#define _CFD3CON_TXQEN_MASK                      0x00100000
#define _CFD3CON_TXQEN_LENGTH                    0x00000001

#define _CFD3CON_OPMOD_POSITION                  0x00000015
#define _CFD3CON_OPMOD_MASK                      0x00E00000
#define _CFD3CON_OPMOD_LENGTH                    0x00000003

