Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcm100.h
#define _CFD4FLTOBJ17_SID11_POSITION             0x0000001D
#define _CFD4FLTOBJ17_SID11_MASK                 0x20000000
#define _CFD4FLTOBJ17_SID11_LENGTH               0x00000001

#define _CFD4FLTOBJ17_EXIDE_POSITION             0x0000001E
#define _CFD4FLTOBJ17_EXIDE_MASK                 0x40000000
#define _CFD4FLTOBJ17_EXIDE_LENGTH               0x00000001

#define _CFD4MASK17_MSID_POSITION                0x00000000
#define _CFD4MASK17_MSID_MASK                    0x000007FF
#define _CFD4MASK17_MSID_LENGTH                  0x0000000B

#define _CFD4MASK17_MEID_POSITION                0x0000000B
#define _CFD4MASK17_MEID_MASK                    0x1FFFF800
#define _CFD4MASK17_MEID_LENGTH                  0x00000012

#define _CFD4MASK17_MSID11_POSITION              0x0000001D
#define _CFD4MASK17_MSID11_MASK                  0x20000000
#define _CFD4MASK17_MSID11_LENGTH                0x00000001

#define _CFD4MASK17_MIDE_POSITION                0x0000001E
#define _CFD4MASK17_MIDE_MASK                    0x40000000
#define _CFD4MASK17_MIDE_LENGTH                  0x00000001

#define _CFD4FLTOBJ18_SID_POSITION               0x00000000
#define _CFD4FLTOBJ18_SID_MASK                   0x000007FF
#define _CFD4FLTOBJ18_SID_LENGTH                 0x0000000B

#define _CFD4FLTOBJ18_EID_POSITION               0x0000000B
#define _CFD4FLTOBJ18_EID_MASK                   0x1FFFF800
#define _CFD4FLTOBJ18_EID_LENGTH                 0x00000012

#define _CFD4FLTOBJ18_SID11_POSITION             0x0000001D
#define _CFD4FLTOBJ18_SID11_MASK                 0x20000000
#define _CFD4FLTOBJ18_SID11_LENGTH               0x00000001

#define _CFD4FLTOBJ18_EXIDE_POSITION             0x0000001E
#define _CFD4FLTOBJ18_EXIDE_MASK                 0x40000000
#define _CFD4FLTOBJ18_EXIDE_LENGTH               0x00000001

#define _CFD4MASK18_MSID_POSITION                0x00000000
#define _CFD4MASK18_MSID_MASK                    0x000007FF
#define _CFD4MASK18_MSID_LENGTH                  0x0000000B

#define _CFD4MASK18_MEID_POSITION                0x0000000B
#define _CFD4MASK18_MEID_MASK                    0x1FFFF800
#define _CFD4MASK18_MEID_LENGTH                  0x00000012

#define _CFD4MASK18_MSID11_POSITION              0x0000001D
#define _CFD4MASK18_MSID11_MASK                  0x20000000
#define _CFD4MASK18_MSID11_LENGTH                0x00000001

#define _CFD4MASK18_MIDE_POSITION                0x0000001E
#define _CFD4MASK18_MIDE_MASK                    0x40000000
#define _CFD4MASK18_MIDE_LENGTH                  0x00000001

#define _CFD4FLTOBJ19_SID_POSITION               0x00000000
#define _CFD4FLTOBJ19_SID_MASK                   0x000007FF
#define _CFD4FLTOBJ19_SID_LENGTH                 0x0000000B

#define _CFD4FLTOBJ19_EID_POSITION               0x0000000B
#define _CFD4FLTOBJ19_EID_MASK                   0x1FFFF800
#define _CFD4FLTOBJ19_EID_LENGTH                 0x00000012

#define _CFD4FLTOBJ19_SID11_POSITION             0x0000001D
#define _CFD4FLTOBJ19_SID11_MASK                 0x20000000
#define _CFD4FLTOBJ19_SID11_LENGTH               0x00000001

#define _CFD4FLTOBJ19_EXIDE_POSITION             0x0000001E
#define _CFD4FLTOBJ19_EXIDE_MASK                 0x40000000
#define _CFD4FLTOBJ19_EXIDE_LENGTH               0x00000001

#define _CFD4MASK19_MSID_POSITION                0x00000000
#define _CFD4MASK19_MSID_MASK                    0x000007FF
#define _CFD4MASK19_MSID_LENGTH                  0x0000000B

#define _CFD4MASK19_MEID_POSITION                0x0000000B
#define _CFD4MASK19_MEID_MASK                    0x1FFFF800
#define _CFD4MASK19_MEID_LENGTH                  0x00000012

#define _CFD4MASK19_MSID11_POSITION              0x0000001D
#define _CFD4MASK19_MSID11_MASK                  0x20000000
#define _CFD4MASK19_MSID11_LENGTH                0x00000001

#define _CFD4MASK19_MIDE_POSITION                0x0000001E
#define _CFD4MASK19_MIDE_MASK                    0x40000000
#define _CFD4MASK19_MIDE_LENGTH                  0x00000001

#define _CFD4FLTOBJ20_SID_POSITION               0x00000000
#define _CFD4FLTOBJ20_SID_MASK                   0x000007FF
#define _CFD4FLTOBJ20_SID_LENGTH                 0x0000000B

#define _CFD4FLTOBJ20_EID_POSITION               0x0000000B
#define _CFD4FLTOBJ20_EID_MASK                   0x1FFFF800
#define _CFD4FLTOBJ20_EID_LENGTH                 0x00000012

#define _CFD4FLTOBJ20_SID11_POSITION             0x0000001D
#define _CFD4FLTOBJ20_SID11_MASK                 0x20000000
#define _CFD4FLTOBJ20_SID11_LENGTH               0x00000001

#define _CFD4FLTOBJ20_EXIDE_POSITION             0x0000001E
#define _CFD4FLTOBJ20_EXIDE_MASK                 0x40000000
#define _CFD4FLTOBJ20_EXIDE_LENGTH               0x00000001

#define _CFD4MASK20_MSID_POSITION                0x00000000
#define _CFD4MASK20_MSID_MASK                    0x000007FF
#define _CFD4MASK20_MSID_LENGTH                  0x0000000B

#define _CFD4MASK20_MEID_POSITION                0x0000000B
#define _CFD4MASK20_MEID_MASK                    0x1FFFF800
#define _CFD4MASK20_MEID_LENGTH                  0x00000012

#define _CFD4MASK20_MSID11_POSITION              0x0000001D
#define _CFD4MASK20_MSID11_MASK                  0x20000000
#define _CFD4MASK20_MSID11_LENGTH                0x00000001

#define _CFD4MASK20_MIDE_POSITION                0x0000001E
#define _CFD4MASK20_MIDE_MASK                    0x40000000
#define _CFD4MASK20_MIDE_LENGTH                  0x00000001

#define _CFD4FLTOBJ21_SID_POSITION               0x00000000
#define _CFD4FLTOBJ21_SID_MASK                   0x000007FF
#define _CFD4FLTOBJ21_SID_LENGTH                 0x0000000B

#define _CFD4FLTOBJ21_EID_POSITION               0x0000000B
#define _CFD4FLTOBJ21_EID_MASK                   0x1FFFF800
#define _CFD4FLTOBJ21_EID_LENGTH                 0x00000012

#define _CFD4FLTOBJ21_SID11_POSITION             0x0000001D
#define _CFD4FLTOBJ21_SID11_MASK                 0x20000000
#define _CFD4FLTOBJ21_SID11_LENGTH               0x00000001

#define _CFD4FLTOBJ21_EXIDE_POSITION             0x0000001E
#define _CFD4FLTOBJ21_EXIDE_MASK                 0x40000000
#define _CFD4FLTOBJ21_EXIDE_LENGTH               0x00000001

