Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcm100.h
#define _CFD4MASK21_MSID_POSITION                0x00000000
#define _CFD4MASK21_MSID_MASK                    0x000007FF
#define _CFD4MASK21_MSID_LENGTH                  0x0000000B

#define _CFD4MASK21_MEID_POSITION                0x0000000B
#define _CFD4MASK21_MEID_MASK                    0x1FFFF800
#define _CFD4MASK21_MEID_LENGTH                  0x00000012

#define _CFD4MASK21_MSID11_POSITION              0x0000001D
#define _CFD4MASK21_MSID11_MASK                  0x20000000
#define _CFD4MASK21_MSID11_LENGTH                0x00000001

#define _CFD4MASK21_MIDE_POSITION                0x0000001E
#define _CFD4MASK21_MIDE_MASK                    0x40000000
#define _CFD4MASK21_MIDE_LENGTH                  0x00000001

#define _CFD4FLTOBJ22_SID_POSITION               0x00000000
#define _CFD4FLTOBJ22_SID_MASK                   0x000007FF
#define _CFD4FLTOBJ22_SID_LENGTH                 0x0000000B

#define _CFD4FLTOBJ22_EID_POSITION               0x0000000B
#define _CFD4FLTOBJ22_EID_MASK                   0x1FFFF800
#define _CFD4FLTOBJ22_EID_LENGTH                 0x00000012

#define _CFD4FLTOBJ22_SID11_POSITION             0x0000001D
#define _CFD4FLTOBJ22_SID11_MASK                 0x20000000
#define _CFD4FLTOBJ22_SID11_LENGTH               0x00000001

#define _CFD4FLTOBJ22_EXIDE_POSITION             0x0000001E
#define _CFD4FLTOBJ22_EXIDE_MASK                 0x40000000
#define _CFD4FLTOBJ22_EXIDE_LENGTH               0x00000001

#define _CFD4MASK22_MSID_POSITION                0x00000000
#define _CFD4MASK22_MSID_MASK                    0x000007FF
#define _CFD4MASK22_MSID_LENGTH                  0x0000000B

#define _CFD4MASK22_MEID_POSITION                0x0000000B
#define _CFD4MASK22_MEID_MASK                    0x1FFFF800
#define _CFD4MASK22_MEID_LENGTH                  0x00000012

#define _CFD4MASK22_MSID11_POSITION              0x0000001D
#define _CFD4MASK22_MSID11_MASK                  0x20000000
#define _CFD4MASK22_MSID11_LENGTH                0x00000001

#define _CFD4MASK22_MIDE_POSITION                0x0000001E
#define _CFD4MASK22_MIDE_MASK                    0x40000000
#define _CFD4MASK22_MIDE_LENGTH                  0x00000001

#define _CFD4FLTOBJ23_SID_POSITION               0x00000000
#define _CFD4FLTOBJ23_SID_MASK                   0x000007FF
#define _CFD4FLTOBJ23_SID_LENGTH                 0x0000000B

#define _CFD4FLTOBJ23_EID_POSITION               0x0000000B
#define _CFD4FLTOBJ23_EID_MASK                   0x1FFFF800
#define _CFD4FLTOBJ23_EID_LENGTH                 0x00000012

#define _CFD4FLTOBJ23_SID11_POSITION             0x0000001D
#define _CFD4FLTOBJ23_SID11_MASK                 0x20000000
#define _CFD4FLTOBJ23_SID11_LENGTH               0x00000001

#define _CFD4FLTOBJ23_EXIDE_POSITION             0x0000001E
#define _CFD4FLTOBJ23_EXIDE_MASK                 0x40000000
#define _CFD4FLTOBJ23_EXIDE_LENGTH               0x00000001

#define _CFD4MASK23_MSID_POSITION                0x00000000
#define _CFD4MASK23_MSID_MASK                    0x000007FF
#define _CFD4MASK23_MSID_LENGTH                  0x0000000B

#define _CFD4MASK23_MEID_POSITION                0x0000000B
#define _CFD4MASK23_MEID_MASK                    0x1FFFF800
#define _CFD4MASK23_MEID_LENGTH                  0x00000012

#define _CFD4MASK23_MSID11_POSITION              0x0000001D
#define _CFD4MASK23_MSID11_MASK                  0x20000000
#define _CFD4MASK23_MSID11_LENGTH                0x00000001

#define _CFD4MASK23_MIDE_POSITION                0x0000001E
#define _CFD4MASK23_MIDE_MASK                    0x40000000
#define _CFD4MASK23_MIDE_LENGTH                  0x00000001

#define _CFD4FLTOBJ24_SID_POSITION               0x00000000
#define _CFD4FLTOBJ24_SID_MASK                   0x000007FF
#define _CFD4FLTOBJ24_SID_LENGTH                 0x0000000B

#define _CFD4FLTOBJ24_EID_POSITION               0x0000000B
#define _CFD4FLTOBJ24_EID_MASK                   0x1FFFF800
#define _CFD4FLTOBJ24_EID_LENGTH                 0x00000012

#define _CFD4FLTOBJ24_SID11_POSITION             0x0000001D
#define _CFD4FLTOBJ24_SID11_MASK                 0x20000000
#define _CFD4FLTOBJ24_SID11_LENGTH               0x00000001

#define _CFD4FLTOBJ24_EXIDE_POSITION             0x0000001E
#define _CFD4FLTOBJ24_EXIDE_MASK                 0x40000000
#define _CFD4FLTOBJ24_EXIDE_LENGTH               0x00000001

#define _CFD4MASK24_MSID_POSITION                0x00000000
#define _CFD4MASK24_MSID_MASK                    0x000007FF
#define _CFD4MASK24_MSID_LENGTH                  0x0000000B

#define _CFD4MASK24_MEID_POSITION                0x0000000B
#define _CFD4MASK24_MEID_MASK                    0x1FFFF800
#define _CFD4MASK24_MEID_LENGTH                  0x00000012

#define _CFD4MASK24_MSID11_POSITION              0x0000001D
#define _CFD4MASK24_MSID11_MASK                  0x20000000
#define _CFD4MASK24_MSID11_LENGTH                0x00000001

#define _CFD4MASK24_MIDE_POSITION                0x0000001E
#define _CFD4MASK24_MIDE_MASK                    0x40000000
#define _CFD4MASK24_MIDE_LENGTH                  0x00000001

#define _CFD4FLTOBJ25_SID_POSITION               0x00000000
#define _CFD4FLTOBJ25_SID_MASK                   0x000007FF
#define _CFD4FLTOBJ25_SID_LENGTH                 0x0000000B

#define _CFD4FLTOBJ25_EID_POSITION               0x0000000B
#define _CFD4FLTOBJ25_EID_MASK                   0x1FFFF800
#define _CFD4FLTOBJ25_EID_LENGTH                 0x00000012

#define _CFD4FLTOBJ25_SID11_POSITION             0x0000001D
#define _CFD4FLTOBJ25_SID11_MASK                 0x20000000
#define _CFD4FLTOBJ25_SID11_LENGTH               0x00000001

#define _CFD4FLTOBJ25_EXIDE_POSITION             0x0000001E
#define _CFD4FLTOBJ25_EXIDE_MASK                 0x40000000
#define _CFD4FLTOBJ25_EXIDE_LENGTH               0x00000001

#define _CFD4MASK25_MSID_POSITION                0x00000000
#define _CFD4MASK25_MSID_MASK                    0x000007FF
#define _CFD4MASK25_MSID_LENGTH                  0x0000000B

#define _CFD4MASK25_MEID_POSITION                0x0000000B
#define _CFD4MASK25_MEID_MASK                    0x1FFFF800
#define _CFD4MASK25_MEID_LENGTH                  0x00000012

#define _CFD4MASK25_MSID11_POSITION              0x0000001D
#define _CFD4MASK25_MSID11_MASK                  0x20000000
#define _CFD4MASK25_MSID11_LENGTH                0x00000001

#define _CFD4MASK25_MIDE_POSITION                0x0000001E
#define _CFD4MASK25_MIDE_MASK                    0x40000000
#define _CFD4MASK25_MIDE_LENGTH                  0x00000001

