Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0512mcm100.h
#define _ADCDATA16_DATA_POSITION                 0x00000000
#define _ADCDATA16_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA16_DATA_LENGTH                   0x00000020

#define _ADCDATA17_DATA_POSITION                 0x00000000
#define _ADCDATA17_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA17_DATA_LENGTH                   0x00000020

#define _ADCDATA18_DATA_POSITION                 0x00000000
#define _ADCDATA18_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA18_DATA_LENGTH                   0x00000020

#define _ADCDATA19_DATA_POSITION                 0x00000000
#define _ADCDATA19_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA19_DATA_LENGTH                   0x00000020

#define _ADCDATA20_DATA_POSITION                 0x00000000
#define _ADCDATA20_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA20_DATA_LENGTH                   0x00000020

#define _ADCDATA21_DATA_POSITION                 0x00000000
#define _ADCDATA21_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA21_DATA_LENGTH                   0x00000020

#define _ADCDATA22_DATA_POSITION                 0x00000000
#define _ADCDATA22_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA22_DATA_LENGTH                   0x00000020

#define _ADCDATA23_DATA_POSITION                 0x00000000
#define _ADCDATA23_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA23_DATA_LENGTH                   0x00000020

#define _ADCDATA24_DATA_POSITION                 0x00000000
#define _ADCDATA24_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA24_DATA_LENGTH                   0x00000020

#define _ADCDATA25_DATA_POSITION                 0x00000000
#define _ADCDATA25_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA25_DATA_LENGTH                   0x00000020

#define _ADCDATA26_DATA_POSITION                 0x00000000
#define _ADCDATA26_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA26_DATA_LENGTH                   0x00000020

#define _ADCDATA27_DATA_POSITION                 0x00000000
#define _ADCDATA27_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA27_DATA_LENGTH                   0x00000020

#define _ADCDATA33_DATA_POSITION                 0x00000000
#define _ADCDATA33_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA33_DATA_LENGTH                   0x00000020

#define _ADCDATA34_DATA_POSITION                 0x00000000
#define _ADCDATA34_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA34_DATA_LENGTH                   0x00000020

#define _ADCDATA35_DATA_POSITION                 0x00000000
#define _ADCDATA35_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA35_DATA_LENGTH                   0x00000020

#define _ADCDATA36_DATA_POSITION                 0x00000000
#define _ADCDATA36_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA36_DATA_LENGTH                   0x00000020

#define _ADCDATA37_DATA_POSITION                 0x00000000
#define _ADCDATA37_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA37_DATA_LENGTH                   0x00000020

#define _ADCDATA38_DATA_POSITION                 0x00000000
#define _ADCDATA38_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA38_DATA_LENGTH                   0x00000020

#define _ADCDATA39_DATA_POSITION                 0x00000000
#define _ADCDATA39_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA39_DATA_LENGTH                   0x00000020

#define _ADCDATA40_DATA_POSITION                 0x00000000
#define _ADCDATA40_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA40_DATA_LENGTH                   0x00000020

#define _ADCDATA41_DATA_POSITION                 0x00000000
#define _ADCDATA41_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA41_DATA_LENGTH                   0x00000020

#define _ADCDATA45_DATA_POSITION                 0x00000000
#define _ADCDATA45_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA45_DATA_LENGTH                   0x00000020

#define _ADCDATA46_DATA_POSITION                 0x00000000
#define _ADCDATA46_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA46_DATA_LENGTH                   0x00000020

#define _ADCDATA47_DATA_POSITION                 0x00000000
#define _ADCDATA47_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA47_DATA_LENGTH                   0x00000020

#define _ADCDATA48_DATA_POSITION                 0x00000000
#define _ADCDATA48_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA48_DATA_LENGTH                   0x00000020

#define _ADCDATA49_DATA_POSITION                 0x00000000
#define _ADCDATA49_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA49_DATA_LENGTH                   0x00000020

#define _ADCDATA50_DATA_POSITION                 0x00000000
#define _ADCDATA50_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA50_DATA_LENGTH                   0x00000020

#define _ADCDATA51_DATA_POSITION                 0x00000000
#define _ADCDATA51_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA51_DATA_LENGTH                   0x00000020

#define _ADCDATA52_DATA_POSITION                 0x00000000
#define _ADCDATA52_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA52_DATA_LENGTH                   0x00000020

#define _ADCDATA53_DATA_POSITION                 0x00000000
#define _ADCDATA53_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA53_DATA_LENGTH                   0x00000020

#define _ADC0CFG_ADCCFG_POSITION                 0x00000000
#define _ADC0CFG_ADCCFG_MASK                     0xFFFFFFFF
#define _ADC0CFG_ADCCFG_LENGTH                   0x00000020

#define _ADC1CFG_ADCCFG_POSITION                 0x00000000
#define _ADC1CFG_ADCCFG_MASK                     0xFFFFFFFF
#define _ADC1CFG_ADCCFG_LENGTH                   0x00000020

#define _ADC2CFG_ADCCFG_POSITION                 0x00000000
#define _ADC2CFG_ADCCFG_MASK                     0xFFFFFFFF
#define _ADC2CFG_ADCCFG_LENGTH                   0x00000020

#define _ADC3CFG_ADCCFG_POSITION                 0x00000000
#define _ADC3CFG_ADCCFG_MASK                     0xFFFFFFFF
#define _ADC3CFG_ADCCFG_LENGTH                   0x00000020

#define _ADC4CFG_ADCCFG_POSITION                 0x00000000
#define _ADC4CFG_ADCCFG_MASK                     0xFFFFFFFF
#define _ADC4CFG_ADCCFG_LENGTH                   0x00000020

